{
  "_default": {
    "1": {
      "name": "Baked Shrimp Scampi",
      "ingredients": [
        "1 pound large shrimp, peeled and deveined",
        "1 cup unsalted butter",
        "1/4 cup white wine",
        "2 tablespoons lemon juice",
        "2 tablespoons dried parsley",
        "1 teaspoon cayenne pepper",
        "2 tablespoons minced garlic",
        "1/2 cup Italian-seasoned bread crumbs"
      ],
      "directions": [
        "Place shrimp into a saucepan, cover with water to a depth of 2 inches over shrimp, and bring to a boil. Cover pan and cook until shrimp are pink, 2 to 3 minutes; drain.",
        "Combine butter, white wine, lemon juice, parsley, cayenne pepper, and garlic in a 2-quart casserole dish.",
        "Place casserole dish in oven and preheat oven to 350 degrees F (175 degrees C).",
        "When butter is melted, lightly toss shrimp in butter mixture until coated. Sprinkle bread crumbs over shrimp.",
        "Bake in the preheated oven until bread crumbs are lightly golden brown, about 15 minutes.",
        ""
      ],
      "times": [
        "15",
        "20",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1189502.jpg"
    },
    "2": {
      "name": "Baked Shrimp Scampi with Tomatoes",
      "ingredients": [
        "1 tablespoon butter",
        "1 pound uncooked shrimp - peeled, deveined, and tails removed",
        "1 (14 ounce) can diced tomatoes with green chile peppers, drained",
        "1 tablespoon lemon juice",
        "1 tablespoon minced garlic",
        "1 cup plain dry bread crumbs",
        "2 teaspoons dried parsley",
        "1/4 cup grated Parmesan cheese"
      ],
      "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Warm butter in a pan over medium-high heat, tilting the pan so the butter coats the bottom. Add shrimp to the pan. Cook shrimp until they are bright pink on the outside and the meat is opaque, 4 to 5 minutes.",
        "Mix shrimp, tomatoes, lemon juice, and garlic in a 10-inch baking pan.",
        "Bake in the preheated oven until tomatoes release their juices, about 45 minutes. Stir in bread crumbs and parsley. Sprinkle Parmesan cheese evenly over the top of the shrimp.",
        "Continue baking until juices have been soaked up and the Parmesan cheese has started to melt, about 15 minutes.",
        ""
      ],
      "times": [
        "10",
        "1",
        "4",
        "1",
        "14"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/423086.jpg"
    },
    "3": {
      "name": "Baked Shrimp Scampi with Linguine",
      "ingredients": [
        "1 (16 ounce) box linguine pasta",
        "3/4 cup sweet cream salted butter",
        "1/2 cup diced sweet onion (such as Vidalia®)",
        "1/4 cup dry white wine",
        "2 tablespoons lemon juice",
        "2 tablespoons Dijon mustard",
        "2 tablespoons minced garlic",
        "1 tablespoon Worcestershire sauce",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon salt",
        "3/4 teaspoon cayenne pepper (optional)",
        "1/2 teaspoon black pepper",
        "2 pounds uncooked medium shrimp, peeled and deveined",
        "3/4 cup shredded Asiago cheese"
      ],
      "directions": [
        "Preheat oven to 450 degrees F (230 degrees C).",
        "Bring a large pot of salted water to boil over high heat. Bring a large pot of lightly salted water to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes. Drain.",
        "Melt butter in a saucepan over medium-high heat. Add onion, white wine, lemon juice, Dijon mustard, garlic, Worcestershire sauce, parsley, salt, cayenne pepper, and black pepper; cook and stir until sauce is combined, 3 to 5 minutes.",
        "Arrange shrimp in a flat layer in a shallow baking dish. Pour the sauce over the shrimp and sprinkle Asiago cheese evenly over the top.",
        "Bake in the preheated oven until the shrimp are pink, 12 to 15 minutes. Serve shrimp and sauce over linguine. Be sure to spoon equal portions of butter sauce over pasta.",
        ""
      ],
      "times": [
        "20",
        "20",
        "40"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7169220.jpg"
    },
    "4": {
      "name": "Garlic Parmesan Baked Shrimp",
      "ingredients": [
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1/4 cup melted butter",
        "1/4 cup grated Parmesan cheese",
        "4 cloves garlic, minced",
        "2 tablespoons olive oil",
        "1/2 cup panko bread crumbs"
      ],
      "directions": [
        "Preheat the oven to 425 degrees F (220 degrees C).",
        "Combine shrimp, butter, Parmesan cheese, garlic, and oil in a bowl. Stir to combine; pour into a baking dish, spreading out evenly. Top with panko bread crumbs.",
        "Bake in the preheated oven until shrimp are bright pink, 15 to 18 minutes.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7613684.jpg"
    },
    "5": {
      "name": "Cajun Garlic Shrimp",
      "ingredients": [
        "1/2 cup butter, cut into pieces",
        "2 pounds raw shrimp, headless and shells on",
        "1 head garlic, peeled and minced",
        "4 teaspoons Cajun seasoning, or to more taste",
        "1 loaf French bread, sliced",
        "1/4 cup butter, softened, or as needed"
      ],
      "directions": [
        "Preheat oven to 450 degrees F (230 degrees C). Place butter pieces in a 9x13-inch baking dish and let melt on the middle oven rack.",
        "Carefully remove the hot baking dish from the oven, stir in minced garlic, and return to the oven until fragrant, about 1 minute, being very careful that garlic does not brown. Remove from the oven.",
        "Add shrimp to the baking dish. Stir until well coated in garlic butter and sprinkle with Cajun seasoning. Return to the oven and bake until bright pink on the outside and the meat is opaque, 5 to 8 minutes. Transfer shrimp and garlic butter to a serving bowl.",
        "Spread bread slices with softened butter and place on a cookie sheet.",
        "Bake bread in the oven until butter is melted and top crusts of bread are golden brown, 5 to 10 minutes.",
        ""
      ],
      "times": [
        "15",
        "15",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7674228.jpg"
    },
    "6": {
      "name": "Sheet Pan Lemon Butter Garlic Shrimp with Asparagus",
      "ingredients": [
        "cooking spray",
        "1 pound fresh asparagus, trimmed",
        "2 tablespoons olive oil, divided",
        "4 cloves garlic, minced",
        "salt, divided",
        "1 pinch ground black pepper, divided",
        "1 1/2 pounds uncooked medium shrimp, peeled and deveined",
        "1 teaspoon paprika",
        "3 tablespoons butter, cubed",
        "3 tablespoons lemon juice"
      ],
      "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed 9x12-inch baking pan with parchment paper and grease with cooking spray.",
        "Place asparagus on the prepared baking pan and drizzle with 1 tablespoon olive oil. Sprinkle with garlic, 1 teaspoon salt, and 1/2 teaspoon pepper; toss until well coated. Arrange asparagus in a single layer.",
        "Bake in the preheated oven until slightly tender, about 6 minutes.",
        "Remove from oven and place shrimp on one side of the pan. Drizzle with remaining 1 tablespoon olive oil, 1 teaspoon salt, 1/2 teaspoon pepper, and smoked paprika; toss until well coated. Place shrimp in a single layer next to the asparagus. Top asparagus and shrimp with cubed butter.",
        "Roast in the preheated oven until shrimp is opaque, about 6 minutes.",
        "Remove pan from oven and drizzle with lemon juice.",
        ""
      ],
      "times": [
        "10",
        "12",
        "22"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/5152934.jpg"
    },
    "7": {
      "name": "Garlic Butter Shrimp with Parsley",
      "ingredients": [
        "3 tablespoons butter",
        "1 bunch fresh parsley, chopped",
        "3 cloves garlic, minced",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1/3 cup dry white wine",
        "1/2 lemon, juiced",
        "salt and freshly ground black pepper to taste"
      ],
      "directions": [
        "Melt butter in a large skillet over medium heat. Add parsley and garlic and cook for 30 seconds. Add shrimp and cook until pink, 3 to 4 minutes. Drizzle with white wine and lemon juice. Season with salt and pepper. Saute briefly until flavors combine, 1 to 2 minutes.",
        ""
      ],
      "times": [
        "5",
        "10",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/5246764.jpg"
    },
    "8": {
      "name": "Garlic, Cilantro, and Lime Sauteed Shrimp",
      "ingredients": [
        "2 teaspoons olive oil",
        "1 onion, chopped",
        "6 cloves garlic, crushed",
        "salt and ground black pepper to taste",
        "2 pounds shrimp, peeled and deveined",
        "1/2 cup chopped fresh cilantro",
        "1/2 lime, juiced, or more to taste"
      ],
      "directions": [
        "Heat oil in a large skillet over medium-high heat. Saute onion, garlic, salt, and pepper in hot oil until onion is soft and golden, about 5 minutes.",
        "Stir shrimp into onion mixture; saute until shrimp are bright pink on the outside and the meat is no longer transparent in the center, about 2 minutes per side. Season with salt and pepper. Add cilantro and lime juice; toss to coat.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1259379.jpg"
    },
    "9": {
      "name": "Cilantro and Parsley Shrimp",
      "ingredients": [
        "4 ounces uncooked angel hair pasta (optional)",
        "olive oil",
        "1 pound uncooked medium shrimp, peeled and deveined",
        "1 onion, chopped",
        "10 sun-dried tomatoes, cut into strips",
        "4 cloves garlic, minced",
        "1/2 bunch chopped fresh parsley",
        "1/2 bunch chopped fresh cilantro"
      ],
      "directions": [
        "Fill a large pot with lightly salted water and bring to a rolling boil over high heat. Once the water is boiling, stir in the angel hair pasta, and return to a boil. Cook the pasta uncovered, stirring occasionally, until the pasta has cooked through, but is still firm to the bite, 4 to 5 minutes. Drain well in a colander set in the sink.",
        "Meanwhile, heat the olive oil in a large skillet over medium-high heat. Stir in the shrimp and onion; cook and stir until the shrimp are beginning to turn pink, about 2 minutes. Stir in the sun-dried tomatoes and garlic. Continue cooking until the shrimp are no longer opaque in the center and the onion has turned translucent, about 4 minutes. Stir in the parsley and cilantro, and pour over pasta to serve.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1772109.jpg"
    },
    "10": {
      "name": "Saba's Shrimp Sandwiches",
      "ingredients": [
        "3 tablespoons olive oil",
        "3 cloves garlic, coarsely chopped",
        "2 Anaheim chile peppers - stemmed, seeded, and chopped",
        "1 pound uncooked shrimp, peeled and deveined",
        "2 tablespoons lemon juice",
        "1 teaspoon seasoned salt (such as LAWRY'S®)",
        "1/4 teaspoon black pepper",
        "1/2 bunch fresh cilantro, chopped",
        "1 (8 ounce) loaf French bread, cut into 4 pieces, split and toasted"
      ],
      "directions": [
        "Heat the olive oil in a skillet over medium heat. Stir in the garlic; cook and stir until the garlic has turned golden, about 2 minutes. Stir in the chopped chile peppers, and cook for 1 to 2 minutes more. Add the shrimp and cook until they are bright pink on the outside and the meat is no longer transparent in the center, about 3 to 5 minutes.",
        "Stir in the lemon juice, seasoned salt, black pepper, and cilantro, and cook for another minute to incorporate the flavors.  Pile the shrimp onto the toasted French bread and serve. Use any liquid remaining in the skillet as dip for the sandwiches, or pour over it the sandwiches before serving.",
        ""
      ],
      "times": [
        "20",
        "10",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/999868.jpg"
    },
    "11": {
      "name": "Cilantro Garlic Lime Sauteed Shrimp",
      "ingredients": [
        "1 1/2 pounds shrimp, tails removed",
        "1 bunch fresh cilantro, chopped, or to taste, divided",
        "1/4 cup olive oil",
        "1/2 yellow onion, chopped",
        "5 cloves garlic, chopped, or more to taste",
        "2 cups salsa",
        "1 red bell pepper, finely chopped",
        "3/4 cup white wine",
        "1 small red chile pepper, pureed",
        "1 teaspoon lemon juice, or to taste",
        "1 teaspoon lime juice, or to taste"
      ],
      "directions": [
        "Toss shrimp and half the cilantro together in a bowl.",
        "Heat olive oil in a skillet over medium heat; saute onion until translucent, 1 to 2 minutes. Add garlic and saute until browned, 1 to 2 minutes.",
        "Stir salsa, red bell pepper, white wine, red chile pepper puree, lemon juice, and lime juice into onion mixture; bring to a boil. Reduce heat and simmer, 2 to 3 minutes. Add shrimp to salsa mixture; cook and stir until shrimp are cooked through, about 5 minutes. Garnish with remaining cilantro and add more lemon or lime juice to taste.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1101499.jpg"
    },
    "12": {
      "name": "Sauteed Shrimp with Garlic, Lemon, and White Wine",
      "ingredients": [
        "1/4 cup olive oil",
        "3 scallions, white bulbs and green tops cut separately into thin slices",
        "4 cloves garlic, minced",
        "1/2 teaspoon dried oregano",
        "24 large shrimp, peeled and deveined",
        "2 1/2 tablespoons lemon juice",
        "2 tablespoons white wine",
        "1 tablespoon water",
        "1/2 teaspoon ground black pepper, or more to taste",
        "1/4 teaspoon salt",
        "2 tablespoons butter",
        "1 tablespoon olive oil",
        "1 tablespoon minced fresh parsley"
      ],
      "directions": [
        "Place 1/4 cup oil, scallion whites, garlic, and oregano in a large skillet or wok over medium heat. Cook, stirring often, until the oil starts to simmer, about 5 minutes. Add shrimp and increase heat to high. Cook, stirring and turning often, until opaque, 4 to 5 minutes.",
        "Add lemon juice and wine to the skillet; simmer for about 1 1/2 minutes. Add water, pepper, and salt; cook for 30 seconds. Stir in butter, 1 tablespoon olive oil, scallion greens, and parsley until even distributed. Arrange the shrimp on warmed plates and spoon the sauce on top.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7406550.jpg"
    },
    "13": {
      "name": "Lemon and White Wine Shrimp Scampi with Asparagus",
      "ingredients": [
        "3 tablespoons olive oil, divided",
        "1 (16 ounce) package linguine pasta",
        "1 onion, chopped",
        "3 cloves garlic, minced, or to taste",
        "4 lemons, juiced, or more to taste",
        "1 pound asparagus, cut into pieces",
        "1 1/2 cups dry white wine",
        "1 pound small shrimp, peeled and deveined",
        "1 (4 ounce) jar capers",
        "1 pinch Italian seasoning, or to taste",
        "salt and pepper to taste",
        "1 tablespoon grated Parmesan cheese, or to taste"
      ],
      "directions": [
        "Bring a large pot of lightly salted water and 1 tablespoon olive oil to a boil. Cook linguine at a boil until tender yet firm to the bite, about 11 minutes.",
        "Heat remaining 2 tablespoons olive oil in a large, deep skillet over medium-high heat. Add onion; cook and stir until softened and translucent, 2 to 3 minutes. Stir in garlic and cook until fragrant, about 1 minute. Pour in juice of 2 lemons and stir well. Add asparagus; cook until softened, 2 to 3 minutes. Pour in white wine. Reduce heat; simmer until thickened and reduced, 5 to 7 minutes. Stir in shrimp; cook until they are bright pink on the outside and the meat is opaque, 4 to 5 minutes.",
        "Mix in remaining lemon juice and capers until you have reached your desired flavor. Season with Italian seasoning, salt, and pepper.",
        "Toss cooked pasta with sauce. Serve topped with Parmesan cheese.",
        ""
      ],
      "times": [
        "10",
        "35",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4559622.jpg"
    },
    "14": {
      "name": "Tilapia Asparagus Bundles With White Wine Sauce",
      "ingredients": [
        "4 (4 ounce) fillets tilapia",
        "12 asparagus spears, trimmed",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 green onions, chopped",
        "Sauce:",
        "2/3 cup white wine",
        "1 1/2 teaspoons cornstarch",
        "2 tablespoons lemon juice",
        "1/4 teaspoon dried basil",
        "1/8 teaspoon ground black pepper"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a baking pan.",
        "Wrap each tilapia fillet around 3 spears of asparagus and secure with wooden toothpicks.  Season the fish with salt and pepper, then place in prepared baking pan.  Cover with foil and bake for 10 minutes.",
        "Remove the foil and sprinkle the chopped green onion over the fish. Return the pan, uncovered, to the oven to bake for an additional 5 to 10 minutes, or until fish flakes easily with a fork.",
        "While the fish is baking, heat the wine in a small saucepan over medium heat.  In a small bowl, combine the cornstarch and lemon juice and whisk until there are no visible clumps.  Add the cornstarch mixture to the white wine, cooking and stirring to prevent lumps.  Add the dried basil and black pepper and continue to cook for 2 minutes or until the sauce is thickened.",
        "To serve, remove the toothpicks from the tilapia fillets and spoon sauce over top.",
        ""
      ],
      "times": [
        "5",
        "20",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/683750.jpg"
    },
    "15": {
      "name": "Parmesan Tilapia with a White Wine Sauce",
      "ingredients": [
        "1/4 cup all-purpose flour",
        "1/2 cup grated Parmesan cheese",
        "1/2 teaspoon dried thyme",
        "1/2 teaspoon dried dill weed",
        "1/4 teaspoon salt",
        "1/2 cup milk",
        "1/2 cup all-purpose flour",
        "4 (4 ounce) tilapia fillets",
        "2 tablespoons butter",
        "1/4 cup dry white wine",
        "1/4 cup milk"
      ],
      "directions": [
        "Mix together 1/4 cup flour, Parmesan cheese, thyme, dill, and salt in a shallow dish.",
        "Pour 1/2 cup milk and 1/2 cup flour in two separate shallow dishes.",
        "Dip tilapia fillets into plain flour, then milk.",
        "Thoroughly coat the fillets with the seasoned flour; reserve the remaining seasoned flour.",
        "Melt butter in a large skillet over medium-high heat. Brown the fillets in the butter, about 2 minutes each side.",
        "Reduce heat to medium-low and continue to cook until the fish is easily flaked with a fork, 2 to 5 minutes more.",
        "Transfer the fillets to a dish.",
        "Increase heat to medium, and pour the remaining seasoned flour into the skillet.",
        "Whisk in white wine; cook and stir until reduced and thickened, about 5 minutes.",
        "Gradually stir in 1/4 cup milk. Reduce heat to low and allow sauce to simmer for 1 or 2 minutes more.",
        "Spoon sauce over tilapia to serve.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/799221.jpg"
    },
    "16": {
      "name": "Pan Seared Lemon Tilapia with Parmesan Pasta",
      "ingredients": [
        "4 ounces elbow macaroni",
        "2 tablespoons light olive oil",
        "2 tilapia fillets",
        "1 tablespoon lemon juice",
        "1/8 teaspoon dried oregano",
        "1 pinch dried basil",
        "1 pinch dried cilantro",
        "1 pinch salt and ground black pepper",
        "For the pasta:",
        "1 tablespoon light olive oil",
        "1/4 cup freshly grated Parmesan cheese",
        "1 teaspoon lemon juice",
        "1 pinch garlic powder",
        "1 pinch dried basil",
        "1 pinch dried oregano",
        "1 pinch dried cilantro (optional)",
        "1 pinch salt and ground black pepper"
      ],
      "directions": [
        "Bring a saucepan of lightly salted water to a boil over medium heat, stir in the macaroni, and return to a boil. Cook the macaroni uncovered, stirring occasionally, until it is cooked through but still firm to the bite, about 8 minutes. Drain well.",
        "Meanwhile, heat 2 tablespoons of olive oil in a skillet over medium heat. Sprinkle both sides of the tilapia fillets with lemon juice, oregano, basil, cilantro, salt, and pepper, and lay the fillets in the heated skillet, making sure they don't touch. Sear the fillets for 2 to 4 minutes on each side, until the fish is golden brown on the outside, and opaque and flaky inside.",
        "Return the hot, cooked macaroni to the saucepan, and stir in 1 tablespoon of olive oil to coat the pasta. Sprinkle on the Parmesan cheese, stir to mix, and stir in 1 teaspoon of lemon juice, the garlic powder, basil, oregano, cilantro, salt, and pepper. Divide the pasta between two plates, and top each with a tilapia fillet.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/381618.jpg"
    },
    "17": {
      "name": "Almond and Parmesan Crusted Tilapia",
      "ingredients": [
        "1 teaspoon olive oil, or as needed",
        "3 cloves garlic, minced",
        "1/2 cup grated Parmesan cheese",
        "1/4 cup buttery spread (such as Smart Balance®), softened",
        "1/4 cup slivered almonds, crushed",
        "3 tablespoons reduced-fat olive oil mayonnaise",
        "2 tablespoons bread crumbs",
        "2 tablespoons fresh lemon juice",
        "1 teaspoon seafood seasoning (such as Old Bay®)",
        "1/4 teaspoon dried basil",
        "1/4 teaspoon ground black pepper",
        "1/8 teaspoon onion powder",
        "1/8 teaspoon celery salt",
        "1 pound tilapia fillets"
      ],
      "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler. Line a broiling pan with aluminum foil or spray with olive oil cooking spray.",
        "Heat olive oil in a skillet over medium heat; cook and stir garlic until fragrant, 3 to 5 minutes.",
        "Mix Parmesan cheese, garlic, buttery spread, almonds, mayonnaise, bread crumbs, lemon juice, seafood seasoning, basil, black pepper, onion powder, and celery salt together in a bowl.",
        "Arrange tilapia fillets in a single layer on the prepared pan; cover pan with aluminum foil.",
        "Broil in the preheated oven for 2 to 3 minutes. Flip fillets, cover pan with aluminum foil, and broil for 2 to 3 more minutes. Remove aluminum foil and cover fillets with Parmesan cheese mixture. Broil in the oven until fish flakes easily with a fork and topping is browned, about 2 more minutes.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1097899.jpg"
    },
    "18": {
      "name": "Macadamia Nut Crusted Tilapia",
      "ingredients": [
        "4 (6 ounce) tilapia",
        "10 ounces macadamia nuts",
        "1 tablespoon soy sauce",
        "2 cloves garlic",
        "1 teaspoon hot sauce",
        "1 tablespoon brown sugar",
        "1 tablespoon olive oil",
        "1 teaspoon black pepper"
      ],
      "directions": [
        "Preheat your oven's broiler. Line a baking sheet with aluminum foil.",
        "Combine macadamia nuts, soy sauce, garlic, hot sauce, brown sugar, olive oil, and black pepper in a food processor; blend until the mixture is the consistency of paste.",
        "Spoon a thick layer of the macadamia mixture on top of each tilapia fillet. Place the fish macadamia mixture-side up on the prepared baking sheet. Under the broiler, cook fish until the macadamia crust is golden brown and the tilapia flakes easily, about 15 minutes.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/54152.jpg"
    },
    "19": {
      "name": "Macadamia Nut Crusted Mahi Mahi",
      "ingredients": [
        "2 ounces macadamia nuts",
        "4 ounces plain bread crumbs",
        "6 (6 ounce) mahi mahi fillets",
        "4 ounces butter",
        "2 ounces shallots, diced",
        "4 cups chicken stock",
        "4 ounces pineapple, rough chopped",
        "4 ounces papaya, rough chopped",
        "4 ounces mango, rough chopped",
        "1 tablespoon shredded coconut",
        "2 habanero peppers, seeded",
        "salt and pepper to taste",
        "white sugar to taste"
      ],
      "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "In a food processor or blender, pulse together macadamia nuts and breadcrumbs until finely ground. Pour nut mixture onto a plate, and coat fish fillets on both sides.",
        "Heat butter in a large skillet over medium heat. Fry fillets on both sides until nuts are golden brown. Remove to a baking pan.",
        "Add shallots to skillet, and cook until translucent. Stir in chicken stock. Mix in pineapple, papaya, mango, coconut, and habanero peppers. Season with salt, pepper, and sugar to taste. Simmer until sauce is thick, about 30 minutes. Strain to remove peppers, fruit, and shallots. Reserve sauce in a pan over low heat.",
        "Bake mahi mahi in preheated oven about 10 minutes, until internal temperature reaches 140 degrees F. Remove fish, and lightly coat with sauce.",
        ""
      ],
      "times": [
        "35",
        "45",
        "1",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/5877883.jpg"
    },
    "20": {
      "name": "Sesame Crusted Mahi Mahi II",
      "ingredients": [
        "3/4 pound mahi mahi fillets",
        "1 teaspoon toasted sesame oil",
        "1/4 teaspoon garlic pepper seasoning",
        "1 tablespoon sesame seeds, toasted",
        "1 1/2 teaspoons grated fresh ginger"
      ],
      "directions": [
        "Preheat an oven to 400 degrees F (200 degrees C). Spray a shallow baking dish with nonstick cooking spray.",
        "Pat mahi mahi dry with paper towels. Drizzle with sesame oil, and season with garlic pepper. Press grated ginger and toasted sesame seeds onto both sides of the fish to coat. Place fish on the prepared baking dish.",
        "Bake in the preheated oven until the fish flakes easily with a fork, 10 to 15 minutes.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/404979.jpg"
    },
    "21": {
      "name": "Sweet Sesame Mahi Mahi",
      "ingredients": [
        "2 cups pineapple chunks",
        "1/4 cup fresh cilantro, chopped",
        "1 tablespoon minced red onion",
        "2 tablespoons lime juice",
        "4 (8 ounce) mahi mahi fillets",
        "2 teaspoons sesame oil",
        "1/4 cup white sesame seeds",
        "1 tablespoon vegetable oil"
      ],
      "directions": [
        "Toss the pineapple, cilantro, red onion, and lime juice together in a bowl until evenly mixed; set aside.",
        "Rub the mahi mahi fillets with the sesame oil to lightly coat.",
        "Sprinkle the sesame seeds evenly over one side of each fillets; gently press the seeds into the fish to assure they stick.",
        "Heat the vegetable oil in a large non-stick skillet over medium heat.",
        "Lay the fillets with the seeded side down into the hot oil; cook for 4 minutes, turn, and continue cooking until the flesh turns opaque and flakes easily with a fork, another 3 to 5 minutes. Serve with the pineapple mixture.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/810789.jpg"
    },
    "22": {
      "name": "Garlic-Lemon Mahi Filets",
      "ingredients": [
        "1 cup white Zinfandel wine",
        "3 tablespoons lemon juice",
        "4 cloves garlic, crushed",
        "1 teaspoon salt, or to taste",
        "1 teaspoon ground black pepper, or to taste",
        "4 (8 ounce) mahi mahi fillets"
      ],
      "directions": [
        "Preheat an outdoor grill for medium heat, and lightly oil the grate.",
        "Stir the white Zinfandel wine, lemon juice, garlic, salt, and black pepper together in a bowl.",
        "Place the mahi mahi fillets in the bowl and turn to coat with the wine mixture; allow to marinate for 10 minutes.",
        "Remove the fillets from the marinade, shaking off any excess moisture from the fish. Discard the marinade.",
        "Grill the fillets on the preheated oven until the fish flakes easily with a fork, 4 to 5 minutes per side.",
        ""
      ],
      "times": [
        "10",
        "10",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/964248.jpg"
    },
    "23": {
      "name": "Garlic-Lime Mahi Mahi",
      "ingredients": [
        "1/4 cup fresh lime juice",
        "2 tablespoons olive oil",
        "1 clove garlic, minced, or more to taste",
        "1 tablespoon soy sauce",
        "1 teaspoon spicy brown mustard",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "2 (4 ounce) fillets mahi mahi"
      ],
      "directions": [
        "Preheat grill for medium heat and lightly oil the grate.",
        "Whisk lime juice, olive oil, garlic, soy sauce, mustard, salt, and pepper together in a bowl; brush over mahi mahi to coat.",
        "Bake on the preheated grill for 5 minutes, flip, brush again with the lime juice mixture, and continue grilling until the fish flakes easily with a fork, about 5 minutes more.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/3770850.jpg"
    },
    "24": {
      "name": "Grilled Mahi Mahi with Lemon Caper Sauce",
      "ingredients": [
        "6 (6 ounce) mahi mahi fillets (or other firm white fish)",
        "2 tablespoons Crisco® Pure Olive Oil",
        "2 limes, juiced",
        "1/2 teaspoon salt",
        "1/4 teaspoon pepper",
        "1 cup mayonnaise",
        "1 (4 ounce) jar Crosse & Blackwell® Capers, rinsed and drained",
        "1 lemon, juiced",
        "6 cups mixed salad greens"
      ],
      "directions": [
        "Place fish in a shallow dish and rub with olive oil, lime juice and salt and pepper. Cover and leave at room temperature 2 hours.",
        "Heat grill to medium-high. Grill fish 4 minutes on each side. Combine mayonnaise, capers and lemon juice. Serve fish on bed of mixed greens and top with mayonnaise mixture.",
        ""
      ],
      "times": [
        "10",
        "10",
        "2",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035966.jpg"
    },
    "25": {
      "name": "Asian Sweet and Sour Meatballs",
      "ingredients": [
        "1 1/2 pounds ground round",
        "1 (8 ounce) can water chestnuts, finely chopped",
        "1 bunch green onions, finely chopped",
        "1 1/2 cups soft bread crumbs",
        "2 cloves garlic, minced",
        "3 tablespoons soy sauce",
        "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze",
        "1 cup chili sauce",
        "1 teaspoon crushed red pepper flakes",
        "1 teaspoon minced fresh ginger root"
      ],
      "directions": [
        "Heat oven to 400 degrees F. Combine meat, water chestnuts, onions, bread crumbs, garlic and soy sauce in medium bowl. Mix thoroughly. Roll into 1 1/2-inch meatballs and place in baking pan.",
        "Bake 30 minutes. While meatballs are baking, combine ham glaze, chili sauce, red pepper flakes and ginger. Heat until hot and bubbly. Remove meatballs from oven, toss with sauce and serve hot.",
        ""
      ],
      "times": [
        "20",
        "30",
        "50"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035961.jpg"
    },
    "26": {
      "name": "Zippy Sloppy Joes",
      "ingredients": [
        "2 pounds extra lean ground beef",
        "1 onion, diced",
        "4 cloves garlic, minced",
        "2 jalapeno chile peppers, seeded and minced",
        "1 red bell pepper, diced",
        "1 (12 ounce) jar Crosse & Blackwell® Seafood Cocktail Sauce",
        "2 tablespoons molasses",
        "2 tablespoons brown sugar",
        "1 teaspoon chipotle seasoning",
        "Salt and pepper to taste",
        "8 whole wheat buns"
      ],
      "directions": [
        "Brown meat and onions in large skillet over medium-high heat 5 minutes or until browned. Drain drippings from pan and discard.",
        "Add garlic, jalapeno peppers and red pepper to beef in pan and cook an additional 5 minutes, stirring occasionally. Stir in cocktail sauce, molasses, sugar, seasoning, salt and pepper. Reduce heat to low, and simmer 5 minutes. Serve on buns.",
        ""
      ],
      "times": [
        "20",
        "15",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035974.jpg"
    },
    "27": {
      "name": "Blue Ribbon Meatloaf from Crosse & Blackwell",
      "ingredients": [
        "2 pounds extra lean ground beef",
        "2 cups crushed buttery round crackers or fresh bread crumbs",
        "2 large eggs, slightly beaten",
        "1 onion, finely chopped",
        "1 (12 ounce) jar Crosse & Blackwell® Seafood Cocktail Sauce, divided",
        "1 teaspoon salt",
        "1/2 teaspoon black pepper",
        "4 slices bacon",
        "2 tablespoons brown sugar",
        "1/2 teaspoon dry mustard"
      ],
      "directions": [
        "Heat oven to 350 degrees F. Combine beef, cracker crumbs, eggs, onion, 3/4 jar cocktail sauce, salt and pepper in large bowl. Stir to combine. Pat mixture into 9x5-inch loaf pan. Place strips of bacon on top of meatloaf.",
        "Bake 50 minutes. While meatloaf is baking, stir together remaining 1/2 cup cocktail sauce, brown sugar and dry mustard in small bowl.",
        "Remove meatloaf after 50 minutes. Spread sauce mixture on top and bake an additional 15 minutes. Remove from oven, serve hot.",
        ""
      ],
      "times": [
        "20",
        "1",
        "5",
        "1",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1214232.jpg"
    },
    "28": {
      "name": "Easy Slow Cooker Ribs",
      "ingredients": [
        "3 racks baby back ribs, cut into 2- to 3-rib portions",
        "Salt and pepper to taste",
        "1 (12 ounce) jar Crosse & Blackwell® Seafood Cocktail Sauce",
        "1/3 cup honey",
        "1 small onion, chopped",
        "1 teaspoon chipolte seasoning",
        "2 teaspoons chili powder",
        "1 tablespoon Worcestershire sauce",
        "2 tablespoons apple cider vinegar"
      ],
      "directions": [
        "Season ribs with salt and pepper. Place in bottom of 5-quart slow cooker.",
        "Combine remaining ingredients in food processor and process until smooth. Cover ribs with sauce. Cook on low 8 to 10 hours, or on high 4 to 5 hours. Serve warm.",
        ""
      ],
      "times": [],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035962.jpg"
    },
    "29": {
      "name": "Pork Tenderloin with Tangy Pineapple Pepper Chutney Sauce",
      "ingredients": [
        "1 (2 pound) pork tenderloin",
        "Salt and pepper to taste",
        "2 tablespoons Dijon mustard",
        "1 (8 ounce) jar Crosse & Blackwell® Pineapple Pepper Chutney",
        "2 tablespoons orange juice",
        "fresh herbs for garnish, such as cilantro, parsley, or mint (optional)"
      ],
      "directions": [
        "Heat oven to 350 degrees F. Season pork with salt and pepper; brush with mustard. Place in roasting pan and bake until internal temperature reaches 145 degrees F, about 35 to 45 minutes. Remove from pan and let rest 10 minutes.",
        "Stir chutney and orange juice together in small saucepan; heat on low until warmed. Slice tenderloin into medallions and serve with sauce. Top with herbs, if desired.",
        ""
      ],
      "times": [
        "10",
        "45",
        "1",
        "5"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035971.jpg"
    },
    "30": {
      "name": "Lamb Chops with Minted Yogurt Sauce",
      "ingredients": [
        "8 (3/4-inch thick) rib lamb chops",
        "1/2 ounce Crosse & Blackwell® Mint Sauce, divided",
        "1 cup Greek-style plain yogurt",
        "6 tablespoons Crisco® 100% Extra Virgin Olive Oil, divided",
        "1 tablespoon chopped fresh parsley",
        "1 teaspoon minced garlic",
        "1/2 teaspoon salt",
        "1/2 teaspoon pepper"
      ],
      "directions": [
        "Place lamb chops and 1/4 cup mint sauce in large resealable plastic bag. Seal bag. Turn to coat chops. Chill 30 minutes.",
        "Whisk yogurt, remaining 1/4 cup olive oil, parsley, garlic, salt, pepper and remaining 1/4 cup mint sauce in medium bowl until combined. Chill until ready to serve.",
        "Heat remaining olive oil in large skillet over medium heat. Add lamb chops to skillet. Cook 3 to 5 minutes on each side until internal temperature reaches 145 degrees F. Cover. Let rest 3 minutes. Serve with minted yogurt sauce.",
        ""
      ],
      "times": [
        "15",
        "15",
        "1"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035968.jpg"
    },
    "31": {
      "name": "Pasta Primavera with Lemon-Caper Sauce",
      "ingredients": [
        "1/4 cup Crisco® Pure Olive Oil",
        "1 large red or yellow onion, chopped",
        "1 pound fresh asparagus spears, cut into 1-inch pieces",
        "1 medium yellow squash or zucchini, quartered lengthwise, sliced 1/4-inch thick",
        "1/4 teaspoon salt",
        "1/2 teaspoon coarsely ground pepper",
        "8 ounces cooked linguine pasta, kept warm",
        "1 cup frozen peas and carrots",
        "Lemon-Caper Sauce:",
        "1/4 cup butter",
        "2 tablespoons Pillsbury BEST® All Purpose Flour",
        "1 1/2 teaspoons minced fresh garlic",
        "1 (14.5 ounce) can chicken broth",
        "3 tablespoons Santa Cruz Organic® Pure Lemon Juice",
        "1/4 cup Crosse & Blackwell® Capers, drained",
        "1/4 cup minced fresh parsley",
        "1 cup finely shredded Parmesan cheese"
      ],
      "directions": [
        "Heat oil in large skillet over medium heat. Add onion. Cook over medium-low heat 7 minutes or until soft. Add asparagus, yellow squash, salt and pepper. Cook an additional 5 minutes or until crisp-tender.",
        "Heat butter in medium saucepan over medium heat. Stir in flour and garlic until blended. Gradually stir in chicken broth until smooth. Bring to a boil over high heat, stirring constantly. Reduce heat to low; simmer 5 minutes. Stir in lemon juice and capers.",
        "Combine pasta, vegetable and sauce mixtures in pasta pot. Add parsley; stir until blended. Sprinkle individual servings with cheese.",
        ""
      ],
      "times": [
        "30",
        "20",
        "50"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1214235.jpg"
    },
    "32": {
      "name": "Sweet and Sour Hot Ham Sandwiches",
      "ingredients": [
        "Crisco® Original No-Stick Cooking Spray",
        "1 pound thinly sliced deli-style smoked ham, quartered",
        "1 tablespoon Crisco® Pure Vegetable Oil",
        "1/2 large yellow onions, cut into very thin wedges",
        "3/4 cup chopped green pepper",
        "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze",
        "1 (8.25 ounce) can crushed pineapple in heavy syrup, undrained",
        "1/3 cup firmly packed brown sugar",
        "2 tablespoons white vinegar",
        "6 kaiser rolls*"
      ],
      "directions": [
        "Coat large skillet with no-stick cooking spray. Heat skillet over medium heat. Saute ham, 1/3 at a time, 15 seconds or until ham is lightly browned. Remove from skillet and place in large bowl.",
        "Heat oil in same skillet over medium-low heat. Add onion and green pepper; saute 7 minutes or until tender.",
        "Stir in ham glaze, undrained pineapple, brown sugar and vinegar. Heat through. Pour over ham in bowl; toss to coat. Serve on rolls.",
        ""
      ],
      "times": [
        "20",
        "15",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1214236.jpg"
    },
    "33": {
      "name": "Fruit Glazed Ham",
      "ingredients": [
        "4 pounds thick ham slices",
        "1 (8 ounce) can pineapple tidbits, drained",
        "1 (11 ounce) can mandarin oranges, drained",
        "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze"
      ],
      "directions": [
        "Heat oven to 325 degrees F. Place ham slices in shallow baking pan. Roast until internal temperature reaches 140 degrees F.",
        "Mix pineapple and oranges with ham glaze in medium microwave-safe bowl. Microwave on HIGH 2 minutes. Spoon half of glaze over top of ham; roast an additional 10 minutes. Place ham slices on serving platter. Serve with remaining warmed glaze.",
        ""
      ],
      "times": [
        "10",
        "1",
        "1",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1214233.jpg"
    },
    "34": {
      "name": "Glazed Apples and Sweet Potatoes with Pecan Streusel Topping",
      "ingredients": [
        "Crisco® Original No-Stick Cooking Spray",
        "4 medium sweet potatoes, cooked* then cut into 3/8-inch slices",
        "4 medium Gala apples, cored, peeled, and cut into 8 wedges",
        "1 cup golden raisins",
        "1 (10 ounce) jar Crosse & Blackwell® Premium Ham Glaze",
        "1/2 teaspoon salt",
        "Pecan Streusel Topping:",
        "2/3 cup packed brown sugar",
        "1/3 cup Pillsbury BEST® All Purpose Flour",
        "1/3 cup chopped pecans",
        "1/3 cup quick rolled oats",
        "3/4 teaspoon cinnamon",
        "1/4 teaspoon salt",
        "1/4 cup cold butter, sliced"
      ],
      "directions": [
        "Heat oven to 350 degrees F. Coat 13 x 9-inch baking dish with no-stick cooking spray.",
        "Combine sliced cooked sweet potatoes, apples, raisins, ham glaze and salt in a large bowl. Spread evenly into prepared dish.",
        "For Streusel: Mix brown sugar, flour, pecans, rolled oats, cinnamon and salt in a medium bowl. Cut in butter with pastry blender until mixture is crumbly. Spread evenly over sweet potato mixture. Bake uncovered 50 to 60 minutes or until potatoes are fork-tender and topping is golden brown.",
        ""
      ],
      "times": [
        "20",
        "1",
        "1",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035963.jpg"
    },
    "35": {
      "name": "Peanut Butter Jalapeno Poppers",
      "ingredients": [
        "5 fresh jalapeno peppers, seeded and chopped",
        "1 cup shredded Monterey Jack cheese",
        "1/3 cup JIF® Creamy Peanut Butter",
        "2 tablespoons Crosse & Blackwell® Major Grey's Chutney",
        "1/2 teaspoon Cajun seasoning",
        "2 eggs, beaten",
        "1/2 cup Pillsbury BEST® All Purpose Flour",
        "1 cup plain panko bread crumbs",
        "Crisco® Pure Peanut Oil",
        "Salt to taste",
        "1 cup sour cream",
        "3 tablespoons minced fresh chives"
      ],
      "directions": [
        "Stir jalapenos, cheese, peanut butter, chutney and Cajun seasoning in medium bowl until blended. Shape into 1/2-inch round balls.",
        "Place egg, flour and breadcrumbs into three separate small bowls. Coat each ball in flour, then egg and breadcrumbs. Chill on baking sheet 1 hour.",
        "Heat 2 inches oil to 350 degrees F in a 6-quart saucepan. Fry poppers 1 1/2-2 minutes each or until golden brown. Drain on paper towel. Season with salt.",
        "Combine sour cream and chives. Serve with poppers.",
        ""
      ],
      "times": [
        "30",
        "15",
        "1",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035970.jpg"
    },
    "36": {
      "name": "Zesty Layered Shrimp Spread",
      "ingredients": [
        "1 pound peeled and deveined frozen cooked small or salad shrimp, thawed and patted dry",
        "2 tablespoons finely chopped fresh parsley, divided",
        "1 teaspoon lemon juice (optional)",
        "1/4 teaspoon coarsely ground pepper",
        "1 (8 ounce) package cream cheese, softened",
        "1 (12 ounce) bottle Crosse & Blackwell® Zesty Shrimp Sauce",
        "1 cup shredded Mexican cheese blend",
        "3/4 cup finely chopped red bell pepper",
        "2 green onions, finely chopped",
        "Assorted crackers"
      ],
      "directions": [
        "Press shrimp between layers of paper towels to remove excess moisture. Repeat if necessary. Combine shrimp, 1 tablespoon parsley, lemon juice, if desired, and pepper in medium bowl; mix well.",
        "Spread cream cheese in bottom of a 9-inch tart or pie plate or spread into a 9-inch circle on large rimmed serving platter.",
        "Top evenly with shrimp mixture and shrimp sauce. Sprinkle evenly with cheese, red pepper, green onions and remaining 1 tablespoon parsley. Cover and chill until ready to serve. Serve with assorted crackers.",
        ""
      ],
      "times": [
        "20",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035972.jpg"
    },
    "37": {
      "name": "Classic Mincemeat Pie",
      "ingredients": [
        "1 (15 ounce) package refrigerated pie crusts, both crusts softened as directed on package",
        "1 (29 ounce) jar Crosse & Blackwell® Mincemeat Filling & Topping or Crosse & Blackwell® Rum & Brandy Mincemeat Filling & Topping",
        "Vanilla ice cream (optional)"
      ],
      "directions": [
        "Heat oven to 425 degrees F. Unroll pie crusts. Line ungreased 9-inch pie plate with one crust. Fill with mincemeat. Cover with second crust and seal edges. Cut slits in top crust to vent steam. Bake 25 to 30 minutes. Serve warm with vanilla ice cream if desired.",
        ""
      ],
      "times": [
        "10",
        "30",
        "40"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035977.jpg"
    },
    "38": {
      "name": "Mincemeat Spice Cake",
      "ingredients": [
        "1/2 cup butter, softened, plus additional for preparing pan",
        "1 1/2 cups Pillsbury BEST® All Purpose Flour",
        "1 1/2 teaspoons baking powder",
        "3/4 cup sugar",
        "1/2 cup milk",
        "1 cup Crosse & Blackwell® Mincemeat Filling & Topping or Crosse & Blackwell® Rum & Brandy Mincemeat Filling & Topping",
        "2 large eggs",
        "Grated peel of 1 lemon",
        "Topping:",
        "1 cup Crosse & Blackwell® Mincemeat Filling & Topping",
        "1/4 cup sugar",
        "1/4 cup rolled oats",
        "1/2 teaspoon ground cinnamon",
        "1/4 cup butter, melted"
      ],
      "directions": [
        "Heat oven to 350 degrees F. Line bottom of springform cake pan with wax paper and butter the sides.",
        "Place flour, baking powder, sugar and 1/2 cup butter in large bowl. Stir in milk, mincemeat, eggs and lemon peel. Mix on low speed of electric mixer 2 minutes or until thoroughly combined. Pour into prepared pan.",
        "Bake 30 minutes. While cake is baking, mix all topping ingredients in small bowl. Remove cake from oven and spoon on topping. Return cake to oven and bake an additional 30 minutes or until toothpick inserted in center comes out clean.",
        ""
      ],
      "times": [
        "15",
        "1",
        "1",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1035969.jpg"
    },
    "39": {
      "name": "Lime-Marinated Mahi Mahi",
      "ingredients": [
        "3/4 cup extra-virgin olive oil",
        "1 clove garlic, minced",
        "1/8 teaspoon ground black pepper",
        "1/2 teaspoon cayenne pepper",
        "1 pinch salt",
        "2 tablespoons lime juice",
        "1/8 teaspoon grated lime zest",
        "2 (4 ounce) mahi mahi fillets",
        "2 twists lime zest (optional)"
      ],
      "directions": [
        "Preheat an outdoor grill for medium heat, and lightly oil the grate.",
        "Whisk the extra-virgin olive oil, minced garlic, black pepper, cayenne pepper, salt, lime juice, and grated lime zest together in a bowl to make the marinade.",
        "Place the mahi mahi fillets in the marinade and turn to coat; allow to marinate at least 15 minutes.",
        "Cook on the preheated grill until the fish flakes easily with a fork and is lightly browned, 3 to 4 minutes per side.",
        "Garnish with the twists of lime zest to serve.",
        ""
      ],
      "times": [
        "10",
        "10",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/6841400.jpg"
    },
    "40": {
      "name": "Grilled Mahi Mahi in Thai Coconut Sauce",
      "ingredients": [
        "1 1/2 cups coconut milk",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped green onion",
        "2 tablespoons lime juice",
        "4 teaspoons minced fresh ginger root",
        "2 cloves garlic, minced",
        "1 teaspoon fish sauce",
        "2 (6 ounce) mahi mahi fillets",
        "2 tablespoons chopped fresh cilantro",
        "2 tablespoons chopped green onion"
      ],
      "directions": [
        "Heat a grill pan over medium heat.",
        "Stir coconut milk, 2 tablespoons cilantro, 2 tablespoons green onion, lime juice, ginger, garlic, and fish sauce together in a saucepan; bring to a boil. Brush the mahi mahi fillets with enough sauce to coat. Cook the remaining sauce at a boil until slightly thickened, 3 to 4 minutes.",
        "Cook the mahi mahi in the grill pan until the fish flakes easily with a fork, about 7 minutes per side. Transfer to a serving platter, top with the sauce, and garnish with 2 tablespoons cilantr and 2 tablespoons green onion to serve.",
        ""
      ],
      "times": [
        "15",
        "15",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1120855.jpg"
    },
    "41": {
      "name": "Basa (Swai) Fish in Coconut Sauce",
      "ingredients": [
        "3/4 cup coconut milk",
        "2 cloves garlic, minced",
        "2 teaspoons soy sauce",
        "1/4 teaspoon salt",
        "1/8 teaspoon hot sauce",
        "1/8 teaspoon ground black pepper",
        "4 (4 ounce) fillets swai fish, cut into 3-inch pieces",
        "1 tablespoon cornstarch",
        "1 tablespoon cold water"
      ],
      "directions": [
        "Mix coconut milk, garlic, soy sauce, salt, hot sauce, and black pepper together in a large skillet or wok; add swai fish. Cook over medium-high heat until fish flakes easily with a fork, about 10 minutes.",
        "Stir cornstarch and cold water together in a bowl; mix into fish mixture and cook until sauce is thickened, 2 to 3 minutes.",
        ""
      ],
      "times": [
        "10",
        "12",
        "22"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/3639098.jpg"
    },
    "42": {
      "name": "Easy Garlic Swai Fish",
      "ingredients": [
        "cooking spray",
        "1 teaspoon minced garlic",
        "1 (4 ounce) fillet swai fish",
        "1 pinch Greek seasoning, or to taste"
      ],
      "directions": [
        "Spray a nonstick skillet with cooking spray; heat over medium-high heat. Cook and stir garlic in hot skillet until lightly browned and fragrant, about 1 minute. Move garlic to one side of skillet.",
        "Place swai fish into the skillet and season with Greek seasoning. Spoon garlic onto top of fish. Cook until edges of fish are white and bottom is browned, about 5 minutes. Flip fish and cook until fish flakes easily with a fork, about 5 minutes more.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/2502648.jpg"
    },
    "43": {
      "name": "Sweet Dijon Basa Swai Fish (or a fish of your choice)",
      "ingredients": [
        "1/4 cup honey",
        "3 tablespoons mayonnaise",
        "2 tablespoons olive oil",
        "2 tablespoons whole-grain Dijon mustard",
        "1 tablespoon lemon juice",
        "4 (4 ounce) fillets swai fish"
      ],
      "directions": [
        "Preheat oven to 425 degrees F (220 degrees C).",
        "Mix honey, mayonnaise, olive oil, mustard, and lemon juice together in a bowl.",
        "Place each fish fillet on separate pieces of aluminum foil. Drizzle honey sauce over each fish fillet. Gently wrap the aluminum foil around each coated fish fillet, crimping the foil together over the top to seal into a packet.",
        "Bake fillets in the preheated oven until fish flakes easily with a fork, about 13 minutes. Place one fish fillet on each serving plate and top with leftover sauce from foil packet.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4556279.jpg"
    },
    "44": {
      "name": "Crispy Baked Basa",
      "ingredients": [
        "1/4 cup mayonnaise",
        "1 tablespoon stone ground mustard",
        "1 teaspoon capers",
        "1 teaspoon ketchup",
        "1/4 teaspoon paprika",
        "1/4 teaspoon hot pepper sauce",
        "1 pound swai fish",
        "1 1/2 tablespoons olive oil",
        "1 cup finely crushed plain Melba toast rounds",
        "salt and pepper to taste",
        "1 clove garlic, minced",
        "1 lemon, sliced"
      ],
      "directions": [
        "Preheat oven to 375  degrees F (190 degrees C).",
        "In a bowl, thoroughly blend the mayonnaise, mustard, capers, ketchup, paprika, and hot pepper sauce.",
        "Brush the basa fillets with about 1 tablespoon olive oil, and roll in the crushed Melba toast to coat. Season with salt and pepper. Use a kitchen sprayer to lightly spray the coated fish with remaining olive oil. Arrange the fish in a baking dish and top with garlic and lemon slices.",
        "Bake 15 minutes in the preheated oven, or until fish is easily flaked with a fork and coating is lightly browned. Serve with the mayonnaise sauce mixture.",
        ""
      ],
      "times": [
        "15",
        "15",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1069486.jpg"
    },
    "45": {
      "name": "Baked Halibut with Crispy Panko",
      "ingredients": [
        "1/2 cup panko bread crumbs",
        "1 1/2 tablespoons butter, melted",
        "1/4 cup chicken stock, or as needed",
        "2 (8 ounce) fillets halibut",
        "1 teaspoon lemon juice",
        "salt and ground black pepper to taste",
        "1 tablespoon Dijon mustard"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Stir panko bread crumbs and melted butter together in a bowl until evenly coated.",
        "Pour enough chicken stock into an oven-proof skillet to cover bottom; arrange halibut fillets in skillet. Drizzle lemon juice over fillets; season with salt and pepper. Spread a think layer of Dijon mustard over each fillet; press bread crumb mixture over mustard layer.",
        "Place skillet in the preheated oven and cook until fillets flake easily with a fork and topping is browned, about 20 minutes.",
        ""
      ],
      "times": [
        "10",
        "20",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/2382791.jpg"
    },
    "46": {
      "name": "Panko-Parmesan Halibut",
      "ingredients": [
        "cooking spray",
        "1/3 cup plain fat-free Greek yogurt",
        "1 tablespoon lemon juice",
        "1 tablespoon Dijon mustard",
        "1/3 cup Italian-style panko bread crumbs",
        "2 tablespoons grated Parmesan cheese",
        "salt and ground black pepper to taste",
        "2 (6 ounce) halibut fillets"
      ],
      "directions": [
        "Preheat oven to 425 degrees F (220 degrees C). Line a baking sheet with aluminum foil, spray an ovenproof wire rack with cooking spray, and place rack on the prepared baking sheet.",
        "Whisk yogurt, lemon juice, and Dijon mustard together in a shallow bowl. Stir panko bread crumbs and Parmesan cheese together in another shallow dish.",
        "Gently dip 1 fillet in yogurt mixture to coat completely; press fillet into bread crumbs. Place coated fillet on the wire rack on the prepared baking sheet. Repeat with remaining fillet.",
        "Bake fillets in the preheated oven until fish flakes easily with a fork, 18 to 22 minutes. An instant-read thermometer inserted into the center should read 140 degrees F (60 degrees C).",
        ""
      ],
      "times": [
        "20",
        "20",
        "40"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/6683065.jpg"
    },
    "47": {
      "name": "Chele's Halibut",
      "ingredients": [
        "2 pounds halibut steak, 1 1/2-inch thickness",
        "1 cup sour cream",
        "1/2 cup chopped green onions",
        "2 tablespoons butter, softened",
        "1/2 teaspoon salt",
        "1/4 teaspoon ground white pepper",
        "1 pinch dried dill weed",
        "1/3 cup grated Parmesan cheese"
      ],
      "directions": [
        "Preheat the oven to 350 degrees F (175 degrees C).",
        "Grease the inside of a 9x13-inch baking dish with butter.",
        "Place halibut in the prepared baking dish.",
        "Mix sour cream, green onions, butter, salt, white pepper, and dill in a bowl.",
        "Spread sour cream mixture over halibut.",
        "Bake halibut in preheated oven until fish flakes easily with a fork, 20 to 25 minutes.",
        "Remove halibut from the oven and sprinkle with Parmesan cheese.",
        "Place oven rack about 6 inches from broiler heat source and turn on oven's broiler.",
        "Place under preheated broiler and broil until cheese is lightly browned, 2 to 3 minutes.",
        ""
      ],
      "times": [
        "10",
        "25",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7613436.jpg"
    },
    "48": {
      "name": "Baked Halibut Sitka",
      "ingredients": [
        "2 pounds halibut fillet, cut into 6 pieces",
        "salt and ground black pepper to taste",
        "1 bunch green onions, chopped",
        "1/2 cup mayonnaise",
        "1/2 cup sour cream",
        "1 teaspoon dried dill weed"
      ],
      "directions": [
        "Preheat the oven to 475 degrees F (245 degrees C).",
        "Grease a 9x13 inch baking dish.",
        "Season halibut with salt and ground black pepper.",
        "Place halibut in the greased baking dish.",
        "Combine green onions, mayonnaise, sour cream, and dill in a bowl.",
        "Spread green onion mixture evenly over each halibut piece.",
        "Bake in the preheated oven until fish is opaque and flakes easily with a fork, about 20 minutes.",
        "Remove from the oven and let stand for 5 minutes before serving.",
        ""
      ],
      "times": [
        "10",
        "20",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7673561.jpg"
    },
    "49": {
      "name": "Pan Fried Halibut",
      "ingredients": [
        "1 egg",
        "1 cup all-purpose flour",
        "2 tablespoons dried herbes de Provence",
        "1 teaspoon seafood seasoning (such as Old Bay®)",
        "1 teaspoon salt",
        "ground black pepper",
        "1 pound skinless, boneless halibut fillets",
        "2 tablespoons olive oil"
      ],
      "directions": [
        "Whisk egg in a small bowl.",
        "Combine flour, herbes de Provence, seafood seasoning, salt, and black pepper in a separate small bowl.",
        "Cut halibut into 4 equal pieces.",
        "Heat olive oil in a large frying pan over medium-low heat.",
        "Dip each piece of halibut in whisked egg.",
        "Dredge all sides of each piece in flour mixture to evenly coat; tap off excess flour.",
        "Place coated pieces immediately in the hot olive oil.",
        "Cook the halibut until lightly browned, about 5 minutes; turn and cook until fish is opaque and flakes easily with a fork, another 2 minutes.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/2842569.jpg"
    },
    "50": {
      "name": "Herb Crusted Halibut",
      "ingredients": [
        "3/4 cup panko bread crumbs",
        "1/3 cup chopped fresh parsley",
        "1/4 cup chopped fresh dill",
        "1/4 cup chopped fresh chives",
        "1 tablespoon extra-virgin olive oil",
        "1 teaspoon finely grated lemon zest",
        "1 teaspoon sea salt",
        "1/4 teaspoon ground black pepper",
        "4 (6 ounce) halibut fillets"
      ],
      "directions": [
        "Preheat the oven to 400 degrees F (200 degrees C).",
        "Line a baking sheet with foil.",
        "Combine panko bread crumbs, parsley, dill, chives, extra-virgin olive oil, lemon zest, sea salt, and black pepper in a bowl. Taste and adjust with more salt if desired.",
        "Rinse halibut fillets and pat dry with a paper towel.",
        "Place halibut fillets onto the prepared baking sheet.",
        "Generously spoon the herbed crumbs over the fish, and lightly press crumb mixture onto each fillet.",
        "Bake in the preheated oven until crumb topping is lightly browned and fish flakes easily with a fork, 10 to 15 minutes.",
        ""
      ],
      "times": [
        "20",
        "10",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/3275393.jpg"
    },
    "51": {
      "name": "Halibut with Creamy Garlic and Herb Sauce",
      "ingredients": [
        "4 (6 ounce) halibut fillets",
        "1 tablespoon lemon juice",
        "salt and pepper to taste",
        "2 sprigs cilantro leaves",
        "2 tablespoons butter",
        "4 green onions, finely chopped",
        "1/4 cup red bell pepper, finely chopped",
        "2 cloves garlic, minced",
        "1 tablespoon crushed red pepper flakes (optional)",
        "1/4 cup dry white wine",
        "1 teaspoon dried dill weed",
        "1 teaspoon dried tarragon",
        "1 cup chicken broth",
        "1/2 cup half-and-half cream",
        "1/2 cup grated Parmesan cheese",
        "1 tablespoon lemon juice",
        "1 tablespoon all-purpose flour",
        "1/4 cup water",
        "toasted slivered almonds"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C). Grease a shallow baking dish.",
        "Rub the halibut fillets with 1 tablespoon of lemon juice, then season with salt and pepper. Place the fillets into the prepared baking dish, then press the cilantro leaves onto the top of the halibut. Bake the halibut in the preheated oven until the fish flakes easily with a fork, 15 to 20 minutes.",
        "Meanwhile, melt the butter in a skillet over medium heat. Stir in the green onions, red bell pepper, garlic, and red pepper flakes until the vegetables have softened, about 5 minutes. Pour in the white wine, and season with dill and tarragon. Simmer for 2 minutes, then add the chicken broth, half-and-half, Parmesan cheese, and remaining 1 tablespoon of lemon juice; season with salt and pepper to taste. Bring to a boil over medium-high heat, then dissolve the flour into the water, and stir into the boiling sauce. Return to a boil, then reduce the heat to medium-low, and simmer until the sauce has thickened, about 10 minutes. Spoon the sauce over the halibut to serve.",
        ""
      ],
      "times": [
        "25",
        "20",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/7686671.jpg"
    },
    "52": {
      "name": "Halibut with Garlic Sauce",
      "ingredients": [
        "1 pound halibut, cut into chunks",
        "salt to taste",
        "1/2 cup cornmeal",
        "1/4 cup sunflower seed oil",
        "1 cup chicken broth",
        "3 cloves garlic, minced",
        "1 bay leaf",
        "ground black pepper to taste"
      ],
      "directions": [
        "Season the halibut with salt, and dredge in the cornmeal to coat.",
        "Heat the oil in a skillet over medium heat. Place the coated halibut in the skillet, and cook 5 minutes, until lightly browned on all sides.",
        "Mix the chicken broth, garlic, and bay leaf in a pot, and bring to a boil. Pour into the skillet with the halibut. Season with pepper. Continue cooking 5 minutes, or until fish is easily flaked with a fork.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/19430.jpg"
    },
    "53": {
      "name": "Pan Fried Halibut Steak with Light Green Sauce",
      "ingredients": [
        "4 (8 ounce) halibut steaks",
        "salt and pepper to taste",
        "1/2 cup all-purpose flour for dusting",
        "1/4 cup melted butter",
        "1/4 cup dry white wine",
        "1 lemon, juiced",
        "1/2 cup heavy cream",
        "2 tablespoons finely chopped fresh parsley",
        "4 tablespoons finely chopped fresh basil",
        "2 tablespoons drained capers"
      ],
      "directions": [
        "Rinse the halibut steaks and pat dry. Season with salt and pepper, then dust with flour.",
        "Melt the butter in a large skillet over medium-high heat. Fry the halibut steaks in the butter for 4 to 5 minutes, until nicely browned. Remove from the skillet and keep warm.",
        "Reduce the heat to medium, and stir the wine into the pan, scraping up any browned bits stuck to the bottom. Mix in the lemon juice, then stir in the cream. Simmer for 2 to 3 minutes or until it starts to thicken. Season with parsley, basil and capers, and stir for another minute. Serve halibut with sauce spooned over it. Garnish with additional parsley if desired.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/437059.jpg"
    },
    "54": {
      "name": "Fresh Herbed Halibut",
      "ingredients": [
        "1 (2 pound) halibut fillet",
        "1 large lemon, quartered",
        "olive oil for brushing",
        "1 teaspoon sea salt",
        "1 teaspoon garlic powder",
        "1 tablespoon dill weed"
      ],
      "directions": [
        "Preheat the oven's broiler and coat a baking sheet or broiling pan with olive oil.",
        "Rinse the fish and pat dry. Place on the greased pan, and brush with olive oil or coat with olive oil cooking spray. Squeeze the juice from the lemon wedges over the entire fillet, and season generously with salt first, then garlic and finally dill.",
        "Broil for 15 to 20 minutes in the preheated oven, until the fillet is opaque and can be flaked with a fork. Broiling time may depend on the thickness of your fillet.",
        ""
      ],
      "times": [
        "10",
        "20",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/3243563.jpg"
    },
    "55": {
      "name": "Grilled Halibut",
      "ingredients": [
        "3/4 cup butter, softened",
        "1 tablespoon lemon juice",
        "1 1/2 teaspoons onion powder",
        "1 1/2 teaspoons dried parsley",
        "3/4 teaspoon dried dill weed (optional)",
        "1/4 teaspoon white sugar (optional)",
        "1/4 teaspoon salt",
        "1/4 teaspoon ground black pepper",
        "4 inch-thick halibut steaks"
      ],
      "directions": [
        "Preheat grill for medium heat and lightly oil the grate.",
        "Stir butter, lemon juice, onion powder, parsley, dill, sugar, salt, and pepper together in a bowl; spread evenly over  the halibut steaks.",
        "Cook on preheated grill until the fish flakes easily with a fork, 5 to 6 minutes per side.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/974024.jpg"
    },
    "56": {
      "name": "Grilled Halibut with Fennel and Orange",
      "ingredients": [
        "2 blood oranges or Valencia or Cara Cara oranges",
        "3 tablespoons CARAPELLI® Extra Virgin Olive Oil",
        "4 (4 ounce) skinless halibut or haddock fillets",
        "1/2 teaspoon smoked paprika",
        "1/2 teaspoon coarse sea salt or kosher salt",
        "1/2 cup very thinly sliced small fennel bulb",
        "2 tablespoons chopped fresh tarragon (optional)"
      ],
      "directions": [
        "Heat a grill to medium-high heat or have a ridged grill pan ready. Cut 1 of the oranges in half and squeeze 2 tablespoons juice. In a medium bowl, combine olive oil and juice. Spoon 2 tablespoons of the mixture over fish. Sprinkle paprika over fish; let stand 10 minutes.",
        "Peel remaining orange and separate into sections. Add the orange sections and fennel to the bowl; toss with olive oil mixture.",
        "Grill fish (or cook in a heated ridged grill pan over medium heat) 4 minutes per side or until fish is opaque in center. Transfer to serving plates and top with fennel and orange mixture and sea salt. Garnish with tarragon if desired.",
        ""
      ],
      "times": [
        "29",
        "29"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/986952.jpg"
    },
    "57": {
      "name": "Prosciutto and Provolone Panini Sandwiches",
      "ingredients": [
        "1/2 cup CARAPELLI® Extra Virgin Olive Oil",
        "8 slices rustic Italian or sourdough bread",
        "1/4 cup prepared basil pesto",
        "16 thin slices  Provolone cheese",
        "12 thin slices  prosciutto",
        "4 whole, well-drained bottled roasted red peppers, cut into strips"
      ],
      "directions": [
        "Heat a panini grill or waffle iron. Brush oil over bread slices. Turn 4 slices over; spread pesto evenly over bread. Top with half of the cheese, tearing to fit if necessary, all of the prosciutto and pepper strips and remaining cheese. Close sandwiches with remaining bread oiled sides up.",
        "Cook (in batches) in panini maker* or waffle iron 3 to 4 minutes or until golden brown and cheese is melted.",
        ""
      ],
      "times": [
        "15",
        "19"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/983891.jpg"
    },
    "58": {
      "name": "Turkey and Provolone Sandwiches",
      "ingredients": [
        "1 tablespoon butter",
        "6 large mushrooms, sliced",
        "1 small onion, chopped",
        "6 hoagie rolls, split lengthwise",
        "1 pound sliced deli turkey meat",
        "1 pound sliced provolone cheese",
        "1/4 cup sliced black olives",
        "6 slices tomato",
        "6 leaves iceberg lettuce"
      ],
      "directions": [
        "Preheat oven to 400 degrees F (200 degrees C).",
        "Melt butter in a small skillet over medium heat. Saute mushrooms and onion until tender; set aside. Place bottom halves of bread on a lined cookie sheet. Top each with 1 to 2 slices turkey, mushroom/onion mixture, and 1 to 2 slices cheese.",
        "Bake in preheated oven for about 5 minutes, or until cheese is melted. Remove from oven and top each sandwich with olives, tomato and lettuce. Place top half of bread on each sandwich and serve.",
        ""
      ],
      "times": [
        "15",
        "5",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/656537.jpg"
    },
    "59": {
      "name": "Grilled Hot Turkey Sandwiches",
      "ingredients": [
        "4 tablespoons mayonnaise",
        "2 tablespoons salsa",
        "2 green onions, chopped",
        "8 slices sourdough bread",
        "1/2 pound deli-sliced turkey",
        "4 slices pepperjack cheese",
        "4 tablespoons butter"
      ],
      "directions": [
        "Mix the mayonnaise, salsa, and green onions in a small bowl. Spread the seasoned mayonnaise evenly on each slice of bread. Layer the turkey and cheese on 4 of the slices. Top with remaining bread to make 4 sandwiches.",
        "Melt 2 tablespoons butter in a large skillet over medium heat. Fry sandwiches in butter until lightly toasted. Add remaining butter to skillet, turn sandwiches over.  Cook until the cheese is melted, and the bread is browned.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/221451.jpg"
    },
    "60": {
      "name": "Grilled Turkey Cuban Sandwiches",
      "ingredients": [
        "Non-stick cooking spray",
        "1 (3 pound) Butterball® Boneless Breast of Turkey Roast, thawed",
        "2 cloves garlic, peeled, sliced",
        "1 tablespoon canola oil",
        "1 tablespoon ground cumin",
        "2 teaspoons salt",
        "1 teaspoon coarsely ground black pepper",
        "2 loaves Cuban, French or Italian bread (15 inches long)",
        "1/4 cup honey mustard",
        "1/2 pound smoked ham",
        "1/2 pound sliced Swiss cheese",
        "12 sandwich-style dill pickle slices"
      ],
      "directions": [
        "Spray cold grate of outdoor gas grill with cooking spray. Prepare grill for medium indirect heat.",
        "Remove turkey from package. Dry with paper towels. Discard gravy packet or refrigerate for another use (within 2 - 3 days). Lift string netting and shift position on roast for easier removal after cooking. Cut small slits, at least 1 inch apart, over entire surface of turkey. Insert 1 garlic slice into each slit. Brush turkey with oil.",
        "Combine cumin, salt and pepper. Sprinkle over turkey.",
        "Place turkey on grill grate over drip pan. Cover grill with lid. Grill 1 1/4 to 1-3/4 hours, or until meat thermometer reaches 170 degrees F when inserted into center of roast. Remove from grill. Let stand 10 minutes.",
        "Remove string netting. Cut half of the turkey into six 1/8-inch-thick slices. Set aside. Refrigerate unsliced turkey for another use.",
        "Cut each bread loaf lengthwise in half. Then, cut each into 3 pieces (for 6 sandwiches). Spread the bottom half of each section with 2 teaspoons mustard. Top with the sliced turkey, ham, cheese and pickles. Cover with tops of bread loaves. Press sandwiches with hands to flatten. Tightly wrap individually in aluminum foil.",
        "Place wrapped sandwiches on grill grate. Top each with heavy iron skillet or brick. Grill 3 to 5 minutes on each side, or until heated through.",
        "Serve sandwiches warm, wrapped in aluminum foil.",
        ""
      ],
      "times": [
        "15",
        "2",
        "2",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1034809.jpg"
    },
    "61": {
      "name": "Turkey Bacon Breakfast Burrito",
      "ingredients": [
        "3 tablespoons vegetable oil",
        "1 (14 ounce) package Butterball® Turkey bacon, cooked and crumbled",
        "16 large eggs",
        "8 (10 inch) flour tortillas, warmed",
        "1 (16 ounce) can seasoned chili beans, warmed",
        "1 cup shredded Cheddar cheese",
        "1 large avocado, halved, pitted, peeled, diced",
        "1 cup chopped cilantro",
        "2 cups salsa or pica de gallo",
        "1 cup sour cream"
      ],
      "directions": [
        "Heat oil in skillet over medium heat. Add eggs to skillet. Cook, pulling cooked portion to the center.  Add bacon and continue cooking until eggs are firm. Remove from heat.",
        "To assemble burritos, evenly portion heated beans down center of each tortilla. Top beans with egg mixture, cheese, avocado and cilantro. Fold in opposite sides of each tortilla, and then roll up, burrito-style. Cut diagonally in half and serve with salsa and sour cream",
        ""
      ],
      "times": [],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1029527.jpg"
    },
    "62": {
      "name": "Smoked Sausage Frittata",
      "ingredients": [
        "1 (14 ounce) package Butterball® Smoked Turkey Dinner Sausage, halved lengthwise, and cut into 1/4-inch-thick slices",
        "1 cup diced green onions, white and green parts",
        "1 1/2 tablespoons olive oil",
        "10 large eggs, slightly beaten",
        "3/4 cup shredded mozzarella cheese",
        "1/3 cup freshly grated Parmesan cheese",
        "16 torn fresh basil leaves",
        "1/4 cup chopped sun-dried tomatoes",
        "1/4 teaspoon ground black pepper",
        "Freshly grated Parmesan cheese (optional)",
        "Fresh basil leaves (optional)"
      ],
      "directions": [
        "Preheat oven to 350 degrees F.",
        "Cook and stir sausage and onions in oil in heavy oven-proof 10-inch skillet on medium heat 5 minutes or until light golden brown.",
        "Combine remaining ingredients in medium bowl. Stir egg mixture into skillet mixture. Cook on medium heat, lifting with a rubber spatula once or twice, to allow uncooked portion to flow underneath. Cook just until egg mixture begins to set, about 6 minutes.",
        "Place skillet in oven. Bake 5 to 7 minutes or until egg mixture is firm to the touch and top is golden brown.",
        "Remove skillet from oven. Carefully run a spatula around edge of frittata to loosen from skillet. Invert skillet onto serving platter. Cut frittata into quarters. Garnish each portion with Parmesan cheese and basil, if desired.",
        ""
      ],
      "times": [
        "15",
        "30",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1034812.jpg"
    },
    "63": {
      "name": "Cranberry Thanksgiving Turkey Sandwich",
      "ingredients": [
        "2 slices wheat bread",
        "2 tablespoons mayonnaise",
        "1/4 cup shredded lettuce",
        "4 ounces sliced Butterball® Maple Honey Turkey",
        "2 tablespoons whole berry cranberry sauce"
      ],
      "directions": [
        "Spread each slice of bread with mayonnaise.",
        "Top with lettuce, turkey and cranberry sauce and remaining slice of bread.",
        ""
      ],
      "times": [
        "5",
        "5"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1029524.jpg"
    },
    "64": {
      "name": "Mediterranean Turkey Pasta Salad",
      "ingredients": [
        "1 1/2 cups olive oil",
        "1/2 cup red wine vinegar",
        "1 tablespoon minced fresh garlic",
        "2 teaspoons dried oregano leaves",
        "3 cups Butterball® Golden Oven Roasted Turkey Breast, sliced thick and cubed",
        "3 cups cooked penne pasta",
        "1 (16 ounce) jar pitted kalamata olives, drained, chopped",
        "1 pint grape tomatoes, halved",
        "8 ounces crumbled feta cheese",
        "1 (5 ounce) package spring lettuce mix",
        "1/2 cup chopped Italian parsley",
        "1/2 cup thinly sliced red onions"
      ],
      "directions": [
        "Whisk olive oil, vinegar, garlic and oregano until well blended; set aside.",
        "Combine remaining ingredients in large salad bowl. Gently toss with dressing. Refrigerate or serve at room temperature.",
        ""
      ],
      "times": [
        "30",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1034811.jpg"
    },
    "65": {
      "name": "Hawaiian Burgers",
      "ingredients": [
        "Sweet Chili Mayo:",
        "1/4 cup chili sauce",
        "1/4 cup mayonnaise",
        "Burgers:",
        "Cooking spray",
        "4 Butterball® Original Seasoned Frozen Turkey Burgers",
        "4 slices Cheddar cheese",
        "4 hamburger buns, horizontally cut in half, toasted",
        "4 grilled pineapple slices",
        "1 cup shredded lettuce",
        "8 thinly sliced red onion rings"
      ],
      "directions": [
        "For Sweet Chili Mayo, combine ingredients. Set aside until ready to use.",
        "Cook frozen burgers according to package directions, until internal temperature reaches 165 degrees F as measured with a meat thermometer. Place 1 slice of cheese over each burger. Grill until cheese is melted. Remove burgers from grill; keep warm. Grill pineapple slices 1 to 2 minutes per side or until there are grill marks on each side. Remove from grill.",
        "Spread Sweet Chili Mayo evenly over cut surfaces of each bun. Layer bottom half of bun with lettuce, cooked burger, onions and pineapple. Cover with top of bun and serve.",
        ""
      ],
      "times": [],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/1029523.jpg"
    },
    "66": {
      "name": "Grilled Turkey Reubens",
      "ingredients": [
        "4 slices rye bread",
        "2 tablespoons extra-virgin olive oil",
        "4 teaspoons mayonnaise",
        "4 teaspoons hot chicken wing sauce",
        "2 slices Swiss cheese",
        "1/2 cup sauerkraut",
        "8 slices deli turkey"
      ],
      "directions": [
        "Preheat a large skillet over medium heat.",
        "Lightly coat one side of each slice of bread with olive oil; lay out the slices, oiled side down, on a plate. Spread 1 teaspoon mayonnaise and 1 teaspoon of hot sauce on each slice. Top two of the slices of bread with a slice of Swiss cheese and 1/4 cup of sauerkraut. Arrange the turkey on the other two slices of bread. Bring the two halves together.",
        "Fry the sandwiches in the preheated skillet until the bread is golden brown on both sides and the cheese has melted.",
        ""
      ],
      "times": [
        "5",
        "5",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/733850.jpg"
    },
    "67": {
      "name": "Grilled Maple Turkey Sandwich",
      "ingredients": [
        "3 strips bacon",
        "4 ounces sliced deli-style maple turkey",
        "2 tablespoons butter, softened",
        "2 slices raisin black bread",
        "4 slices Swiss cheese",
        "2 tablespoons honey mustard"
      ],
      "directions": [
        "Place bacon into a skillet over medium heat, and cook until crisp. Remove, and drain on paper towels. Drain bacon grease from skillet. Add maple turkey to the skillet, and cook briefly, just long enough to heat through.",
        "Butter both sides of the bread. Layer one slice with two slices of the Swiss cheese, then layer with the maple turkey, and the bacon. Drizzle with honey mustard, and top with remaining two slices of Swiss cheese. Top with remaining bread slice, and cut sandwich in half. Return sandwich halves to the skillet, and cook over medium heat, turning once, until cheese begins to melt, 4 to 5 minutes.",
        ""
      ],
      "times": [
        "5",
        "10",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/861326.jpg"
    },
    "68": {
      "name": "Grilled Turkey and Swiss Sandwich",
      "ingredients": [
        "1 tablespoon mayonnaise",
        "2 slices thick-cut rye bread",
        "2 slices Swiss cheese",
        "2 slices leftover turkey meat, or to taste",
        "1/4 cup baby spinach, or to taste"
      ],
      "directions": [
        "Set oven rack about 6 inches from the heat source and preheat the oven's broiler.",
        "Spread mayonnaise onto 1 side of each bread slice. Layer Swiss cheese, turkey, and spinach onto the mayonnaise-side of 1 bread slice; top with second bread slice. Place sandwich on a baking sheet.",
        "Broil in the preheated oven until heated through and cheese is bubbling, about 5 minutes.",
        ""
      ],
      "times": [
        "10",
        "5",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1105599.jpg"
    },
    "69": {
      "name": "Waffle Iron Grilled Cheese Sandwiches",
      "ingredients": [
        "2 tablespoons mayonnaise",
        "2 teaspoons Dijon mustard",
        "4 slices whole-grain bread",
        "2 ounces shredded pepperjack cheese"
      ],
      "directions": [
        "Preheat a waffle iron according to manufacturer's instructions.",
        "Mix mayonnaise and Dijon mustard together in a bowl; spread onto 1 side of each bread slice. Sprinkle pepperjack cheese over mayo-mustard layer of 2 bread slices. Cover cheese layer with a second bread slice, creating 2 whole sandwiches.",
        "Place 1 sandwich in the waffle iron, taking care not to push down all the way. Wait until the bread begins to soften from the heat before starting to gently close the waffle iron, about 2 minutes. Apply more pressure to the top part of the iron, eventually closing it after a total of 3 to 4 minutes. Cook until browned, 2 to 3 minutes more. Repeat with the remaining sandwich.",
        ""
      ],
      "times": [
        "10",
        "7",
        "17"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/3732694.jpg"
    },
    "70": {
      "name": "Bacon, Asparagus, and Cheese Sandwiches",
      "ingredients": [
        "8 slices bacon",
        "1 (10 ounce) can asparagus tips, drained",
        "4 thick slices sourdough bread, lightly toasted",
        "4 slices sharp Cheddar cheese"
      ],
      "directions": [
        "Adjust oven rack to upper position, and set oven to broil.  You may also use a toaster oven to cook the sandwiches if you don't want to broil them in the oven.",
        "Place bacon in a large, deep skillet. Cook over medium high heat until evenly brown and crispy. Drain on paper towels.",
        "Place a few spears of asparagus on a slice of bread.  Top with 2 slices crisp bacon then a slice of cheese.",
        "Toast under the broiler until the cheese is melted and bubbly.",
        ""
      ],
      "times": [
        "5",
        "5",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/250x250/646717.jpg"
    },
    "71": {
      "name": "Roasted Raspberry Chipotle Grilled Cheese Sandwich on Sourdough",
      "ingredients": [
        "4 tablespoons butter, softened",
        "4 slices sourdough bread",
        "8 Borden® Mild Cheddar Slices",
        "4 tablespoons roasted raspberry chipotle sauce"
      ],
      "directions": [
        "Place a skillet over medium heat.",
        "Butter 4 slices of bread with a tablespoon of butter each. Place 2 slices butter side down onto skillet. Place 2 slices of cheese on each.",
        "Spread 2 tablespoons of the roasted raspberry chipotle sauce onto each sandwich, and top each with 2 more slices of cheese.",
        "Top each with remaining bread, butter side up. Grill until bottom is lightly browned; flip sandwiches over. Grill other side until browned and cheese has melted.",
        ""
      ],
      "times": [
        "5",
        "5",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4061386.jpg"
    },
    "72": {
      "name": "Apple and Bacon Grilled Cheese",
      "ingredients": [
        "2 slices cracked wheat bread",
        "2 thin slices aged Cheddar cheese",
        "2 slices Honeycrisp apple, or more to taste",
        "2 cooked bacon strips"
      ],
      "directions": [
        "Preheat a sandwich/panini press according to manufacturer's instructions.",
        "Set one slice of bread on a work surface. Top bread with 1 slice cheese, apple slices, bacon slices, and remaining 1 slice cheese. Place remaining bread slice on top.",
        "Cook sandwich in the preheated panini press until bread is lightly toasted and cheese begins to melt, about 5 minutes.",
        ""
      ],
      "times": [
        "10",
        "5",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1672270.jpg"
    },
    "73": {
      "name": "Broccoli Noodles and Cheese Casserole",
      "ingredients": [
        "1 (16 ounce) package egg noodles",
        "1 head broccoli, cut into florets",
        "2 cups cottage cheese",
        "2 cups shredded Cheddar cheese"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).  Bring a large pot of lightly salted water to a boil. Add pasta and cook for 8 to 10 minutes or until al dente; drain.",
        "Steam broccoli until bright green and tender, 5 to 10 minutes.  Combine broccoli, pasta and cottage cheese in 2 quart baking dish; mix well.",
        "Sprinkle pasta mixture with Cheddar cheese and bake for 8 to 10 minutes, until cheese is bubbly.",
        ""
      ],
      "times": [
        "30",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/623011.jpg"
    },
    "74": {
      "name": "Breakfast Casserole from Borden® Cheese",
      "ingredients": [
        "1 pound bulk pork sausage",
        "1 (32 ounce) package frozen potato rounds",
        "10 eggs",
        "1 cup milk",
        "8 ounces Borden® Colby Jack Shredded Cheese",
        "8 slices bacon, cooked crisp and drained"
      ],
      "directions": [
        "Preheat oven to 350 degrees F. Spray a 13 x 9 baking dish with non-stick cooking spray.",
        "Heat a non-stick skillet over medium-high heat until hot.  Add the sausage to the skillet and cook, stirring occasionally, until browned; drain and set aside.",
        "Place the potato rounds in the prepared baking dish. Arrange the cooked sausage evenly over the potatoes. Beat the eggs with the milk in a medium bowl or a 1-quart glass measure. Pour egg mixture over potatoes and sausage. Sprinkle cheese over eggs. Crumble bacon over cheese. Cover with foil, and bake for 40 minutes or until eggs are set and the dish has cooked through. Uncover, and bake an additional 10 minutes.",
        ""
      ],
      "times": [
        "10",
        "1",
        "1",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4023533.jpg"
    },
    "75": {
      "name": "Baked Spaghetti from Borden® Cheese",
      "ingredients": [
        "1 (16 ounce) package spaghetti, cooked and drained",
        "1 cup chopped onion",
        "1 cup chopped green bell pepper",
        "1 tablespoon butter",
        "1 pound ground beef",
        "1 (28 ounce) can tomatoes with liquid, chopped",
        "1 (4 ounce) can mushrooms, drained",
        "1 (2.25 ounce) can sliced ripe olives, drained",
        "2 cups Borden® Shredded Mild Cheddar Cheese",
        "1 (10.75 ounce) can condensed cream of mushroom soup, undiluted",
        "Grated Parmesan cheese",
        "2 teaspoons dried oregano"
      ],
      "directions": [
        "Preheat oven to 350 degrees F. Spray a 9x13-inch baking dish with non-stick cooking spray. Cook spaghetti according to package directions.",
        "Heat butter in a large non-stick skillet over medium-high heat until hot. Sauté onion and pepper until tender. Add ground beef and cook until beef has browned, drain.",
        "Stir in tomatoes, mushrooms, olives and oregano. Bring to a boil and reduce heat to medium. Simmer for 10 minutes.",
        "Place half of spaghetti in the prepared baking dish. Top with half of vegetable-meat mixture. Sprinkle with half of Cheddar cheese. Repeat layers. Combine soup with 1/2 cup water; pour over casserole. Sprinkle with Parmesan cheese. Bake uncovered for 30 to 35 minutes or until thoroughly heated.",
        ""
      ],
      "times": [
        "15",
        "30",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4023530.jpg"
    },
    "76": {
      "name": "Sloppy Boats",
      "ingredients": [
        "4 (6-inch) crusty sandwich rolls, unsplit",
        "1 pound lean ground beef",
        "1 (15 ounce) can sloppy joe sauce",
        "1 cup Borden® Mild Cheddar Shreds"
      ],
      "directions": [
        "Preheat oven to 375 degrees F (190 degrees C).",
        "Cut a hole at the top of each sandwich roll and hollow out the bread leaving about a 1/2 inch shell (discard the extra bread or save for another use). Place rolls on a rimmed baking sheet.",
        "Lightly oil a skillet and place over medium to medium-high heat. Cook ground beef and stir to crumble. Cook until no longer pink, about 10 minutes. Use a paper towel to sop up any grease, if necessary.",
        "Pour sloppy joe sauce over the beef and continue cooking until heated through, about 5 minutes.",
        "Evenly spoon beef mixture into each sandwich roll and top with shredded Cheddar cheese.",
        "Bake in preheated oven until cheese is melted, about 10 minutes.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4061391.jpg"
    },
    "77": {
      "name": "Traditional Mexican Molletes",
      "ingredients": [
        "4 bolillo rolls, sliced in half lengthwise",
        "3 tablespoons butter, room temperature",
        "1 (16 ounce) can refried beans, heated",
        "1 (7 ounce) package Borden® Southwestern Cheddar & Monterey Jack Shredded Cheese",
        "Mexican salsa or pico de gallo, for serving"
      ],
      "directions": [
        "Preheat oven to 400 degrees F (200 degrees C). Line a rimmed baking sheet with parchment paper.",
        "Remove some of the bread from the middle of bread halves to accommodate more toppings. Spread about 1 teaspoon butter on each half.",
        "Spread 2 to 3 tablespoons warmed refried beans on bread. Sprinkle about 1/4 cup Borden(R) Cheddar and Monterey Jack shredded cheese on the beans. Place bread halves on prepared baking sheet.",
        "Bake in preheated oven until the cheese is melted and bubbly and the bread is crispy, 15 to 20 minutes.",
        "Top molletes with Mexican salsa or pico de gallo.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4061393.jpg"
    },
    "78": {
      "name": "Bacon & Egg Biscuit Cups",
      "ingredients": [
        "6 slices bacon",
        "1 (16.3 ounce) can refrigerated biscuit dough",
        "6 eggs",
        "1/2 cup Borden® Cheddar and Monterey Jack Shreds",
        "3 tablespoons Borden® Cheddar and Monterey Jack Shreds, for topping"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Place bacon in a large skillet and cook over medium-high heat, turning occasionally, until evenly browned, about 10 minutes. Drain bacon slices on paper towels. Crumble or chop into small pieces.",
        "Separate 6 biscuits into 2 rounds each. Press rounds into 12 cups of a muffin tin, pressing up sides to form biscuit dough cups.",
        "Mix eggs, bacon pieces, and 1/2 cup shredded cheese together in a bowl.",
        "Fill muffin pan biscuits with egg mixture about 3/4 full. Sprinkle remaining 3 tablespoons cheese on top.",
        "Bake in preheated oven until egg mixture is set, 18 to 22 minutes. Let cool 5 minutes before serving.",
        ""
      ],
      "times": [
        "10",
        "18",
        "28"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4117997.jpg"
    },
    "79": {
      "name": "Tangy Turkey Taco Cups",
      "ingredients": [
        "1 (16.3 ounce) can refrigerated flaky biscuit dough",
        "2 teaspoons vegetable oil",
        "1 pound ground turkey",
        "1 (1.25 ounce) package taco seasoning mix",
        "1 (15 ounce) can sloppy joe sauce",
        "3 slices Borden® American Singles, cut into 4 small squares"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Separate 6 biscuits into 2 rounds each. Gently stretch each round into a 5-inch circle. Press into cups of a non-stick muffin tin.",
        "Lightly oil a skillet and place over medium-high heat. Cook turkey in skillet, separating into small pieces as it browns.  When turkey is no longer pink, turn heat down to medium-low. Add taco seasoning, stirring to combine. Stir in Sloppy Joe sauce; continue cooking until heat through, about 5 minutes.",
        "Fill biscuit-lined muffin cups with turkey mixture.",
        "Bake in preheated oven until browned and hot, about 13 minutes.",
        "Divide each slice of cheese into quarters, and place one-quarter slice on top of each filled cup.",
        "Bake 3 minutes more, or until cheese is melted.",
        "Allow to cool in the pan 5 minutes, then place on a rack until cool enough to eat.",
        ""
      ],
      "times": [
        "14",
        "14"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4169563.jpg"
    },
    "80": {
      "name": "Sweet and Spicy Turkey Sandwich",
      "ingredients": [
        "2 slices (1/2 inch thick) hearty country bread",
        "4 slices roasted turkey breast",
        "1 slice pepperjack cheese",
        "2 teaspoons butter",
        "4 teaspoons strawberry preserves"
      ],
      "directions": [
        "Heat a small skillet over medium heat. Butter one side of each of the bread slices with one teaspoon butter. Place one slice, butter side down, in the skillet. Top with the turkey and cheese slices. Place the second slice of bread on top, butter side up.",
        "When the first side of the sandwich is golden brown, turn and brown the other side, 3 to 5 minutes per side, or until the cheese begins to melt.",
        "Remove sandwich to a plate and top with strawberry preserves, or serve the preserves on the side.",
        ""
      ],
      "times": [
        "5",
        "10",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1009371.jpg"
    },
    "81": {
      "name": "Cheesy Pork Chops with Spicy Apples",
      "ingredients": [
        "1 tablespoon butter",
        "1 onion, sliced",
        "1 pinch red pepper flakes",
        "1 apple, cored and sliced",
        "2 teaspoons white sugar",
        "2 tablespoons balsamic vinegar",
        "4 pork chops",
        "salt and pepper to taste",
        "4 slices extra sharp Cheddar cheese"
      ],
      "directions": [
        "Prepare a grill for high heat.",
        "While the grill heats, melt the butter in a skillet over medium heat. Add the onion, and cook until soft. Season with red pepper flakes then add the sliced apple. Stir in the sugar and balsamic vinegar, and simmer for 5 minutes, or until apples are soft and golden.",
        "Season the pork chops with salt and pepper. Grill for 3 to 5 minutes per side, depending on thickness. Spoon the onions and apples on top of the chops, and top with a slice of Cheddar cheese. Cover the grill, and cook for about 3 minutes until cheese is melted and bubbling.",
        ""
      ],
      "times": [
        "15",
        "20",
        "35"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/675588.jpg"
    },
    "82": {
      "name": "Cheesy Sausage and Vegetable Soup",
      "ingredients": [
        "1 tablespoon vegetable oil",
        "1 pound sausage links, cut into 1/2-inch thick slices",
        "2 pounds zucchini, diced",
        "4 large carrots, thinly sliced",
        "2 tablespoons Borden® Salted Butter",
        "3 tablespoons all-purpose flour",
        "2 large yellow onions, chopped",
        "2 cloves garlic, chopped",
        "2 (12 ounce) cans chicken or beef broth",
        "1 (12 ounce) can evaporated milk",
        "1 1/2 cups Borden® Finely Shredded Mild Cheddar Cheese, divided"
      ],
      "directions": [
        "Heat oil in a large skillet non-stick skillet over medium high heat until hot. Add sausage, cook and stir until browned.  Remove sausage from skillet and keep warm. Add onions and garlic and cook until onions are tender.  Stir in zucchini and carrots to the skillet and cook, stirring occasionally, until the carrots are crisp tender; set aside.",
        "Melt butter in a large saucepan. Whisk in flour until it forms a paste. Add the broth, a little at a time, whisking after each addition until the mixture is smooth. Add the remaining broth and bring to a boil. Reduce to a simmer and stir in the evaporated milk and 1 cup cheese. Continue cooking, stirring continuously, until the cheese has melted.  Stir in the reserved sausage and vegetable mixture.",
        "Top with remaining 1/2 cup cheese before serving.",
        ""
      ],
      "times": [
        "15",
        "30",
        "45"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4023539.jpg"
    },
    "83": {
      "name": "Spicy Serrano Burgers",
      "ingredients": [
        "1 pound lean ground beef (90% lean)",
        "1/4 cup dark beer (such as Guinness®)",
        "1 (6 inch) serrano pepper, diced",
        "2 tablespoons butter, softened",
        "4 slices Monterey Jack cheese with jalapeno peppers"
      ],
      "directions": [
        "Preheat an outdoor grill for high heat and lightly oil the grate.",
        "Mix ground beef, beer, serrano pepper, and butter together in a bowl; form into 4 patties.",
        "Cook the burgers on the preheated grill for 5 minutes. Flip and continue cooking for 3 minutes. Top each burger with 1 slice Monterey Jack cheese and cook until burgers are no longer pink in the center and the juices run clear, about 2 minutes more. An instant-read thermometer inserted into the center should read at least 165 degrees F (74 degrees C).",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1093795.jpg"
    },
    "84": {
      "name": "Flourless Eggplant Pizza",
      "ingredients": [
        "1/2 large eggplant, sliced into thin rounds",
        "1/2 cup grated Parmesan cheese",
        "1 tablespoon extra virgin olive oil",
        "1/3 cup tomato sauce",
        "1/3 cup shredded Cheddar cheese",
        "salt and ground black pepper to taste"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Arrange eggplant rounds on a baking sheet;lightly coat with olive oil.",
        "Bake eggplant rounds in preheated oven until hot, about 5 minutes.",
        "Flip the eggplant rounds; top with Parmesan cheese in an even layer to cover. Return eggplant to oven and bake until the cheese is melted, about 5 minutes.",
        "Drop a dollop of tomato sauce into the center of each eggplant round; top with Cheddar cheese.",
        "Bake until Cheddar cheese is bubbling, about 5 minutes more. Season with salt and pepper to serve.",
        ""
      ],
      "times": [
        "10",
        "15",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1615557.jpg"
    },
    "85": {
      "name": "Sun-Dried Tomato and Arugula Pizza",
      "ingredients": [
        "1 cup tomato sauce",
        "1 (12 inch) pre-baked pizza crust",
        "2 cups shredded mozzarella cheese",
        "1 cup chopped sun-dried tomatoes",
        "2 cups chopped arugula"
      ],
      "directions": [
        "Preheat oven to 350 degrees F (175 degrees C).",
        "Spread the tomato sauce evenly atop the pizza crust. Arrange the mozzarella cheese and tomatoes on the pizza crust.",
        "Bake in the preheated oven until the cheese is bubbly, about 20 minutes. Remove from oven and top with arugula to serve.",
        ""
      ],
      "times": [
        "10",
        "20",
        "30"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/2261883.jpg"
    },
    "86": {
      "name": "Cheesy Cracker Bread Pizza",
      "ingredients": [
        "1 (12 inch) piece cracker bread or flatbread",
        "1 tablespoon olive oil, plus extra for brushing",
        "1 (8 ounce) package Borden® Cheese Mild Cheddar Shreds",
        "8 strips thick-cut bacon, cooked crisp and broken into 1-inch pieces",
        "4 cloves garlic, sliced",
        "4 plum tomatoes, sliced",
        "1/2 red onion, cut into strips",
        "1/4 cup chopped fresh flat-leaf parsley"
      ],
      "directions": [
        "Preheat oven to 400 degrees F.",
        "Brush the cracker bread with a small amount of olive oil and place on cookie sheet. Spread 11/2 cups Borden® Cheese Mild Cheddar Shreds evenly around the cracker bread. Top evenly with bacon pieces pizza.",
        "Heat remaining 1 tbsp. olive oil in a small skillet over medium heat until hot.  Add the sliced garlic cloves and sauté until slightly browned. Sprinkle over onto the pizza. Arrange sliced tomatoes and red onions around the pizza.",
        "Add parsley to the remaining ½ cup cheese and spread over other ingredients.",
        "Bake 10 minutes or until cheese is melted. Cut into squares and serve immediately. Garnish with fresh basil leaves, if desired.",
        ""
      ],
      "times": [
        "10",
        "10",
        "20"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4023551.jpg"
    },
    "87": {
      "name": "Elsie's Baked Mac and Cheese",
      "ingredients": [
        "1 1/2 cups Borden® Triple Cheddar Natural Shreds",
        "1 cup Borden® Colby Jack Natural Shreds",
        "2 cups uncooked elbow macaroni",
        "2 tablespoons Borden® Butter",
        "2 tablespoons all-purpose flour",
        "1/4 cup Borden® Vitamin D Milk",
        "1 cup Borden® Half & Half",
        "1/4 teaspoon cayenne pepper, or to taste",
        "1/2 teaspoon ground black pepper",
        "Salt to taste"
      ],
      "directions": [
        "Preheat oven to 350 degrees F. Spray the inside of a 1 1/2-quart casserole dish with non-stick cooking spray.  Combine Cheddar and Colby Jack cheeses in a medium bowl and set aside.",
        "Cook macaroni in boiling salted water according to package directions; drain well and set aside.",
        "Meanwhile, melt butter in a medium saucepan over low heat. Blend in flour, stirring constantly, until smooth and bubbly. Gradually whisk in milk and half & half. Stir constantly, until mixture boils and thickens (about 2 to 3 minutes). Remove from heat and add cayenne and black peppers, and 2 cups of the reserved cheese mixture; stir until cheese is melted and sauce is smooth.",
        "Stir cooked macaroni into the sauce and season to taste. Place in the prepared casserole dish. Top with remaining 1/2 cup of cheese and dot with additional butter, if desired. Bake 25 to 30 minutes or until heated through and lightly browned.",
        ""
      ],
      "times": [
        "10",
        "40",
        "50"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4023544.jpg"
    },
    "88": {
      "name": "Spicy Ham and Grilled Cheese Sandwich",
      "ingredients": [
        "2 slices Swiss cheese",
        "2 slices deli ham",
        "1 green chile pepper",
        "2 slices rye bread",
        "1 tablespoon butter, softened"
      ],
      "directions": [
        "Preheat a skillet over medium heat.",
        "Layer cheese, ham, and chile pepper on one slice of bread, then top with the other slice. Lightly butter both sides of the sandwich before carefully placing it in the skillet. Grill until cheese is melted and bread appears golden brown, about 3 minutes per side.",
        ""
      ],
      "times": [
        "5",
        "6",
        "11"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/409136.jpg"
    },
    "89": {
      "name": "Grilled Ham and Cheese With a Twist",
      "ingredients": [
        "1/4 cup mango chutney",
        "4 slices crusty bread, cut diagonally from a large loaf",
        "6 slices black forest ham",
        "4 slices white Cheddar cheese",
        "2 tablespoons butter, softened"
      ],
      "directions": [
        "Spread chutney onto two slices of bread. Place three slices of ham on top of each piece of bread followed by two slices of Cheddar cheese. Place the remaining slices of bread on top of the cheese, then butter the outsides of the sandwiches on both sides.",
        "Cook in a large skillet over medium heat until golden brown, then flip over, and continue cooking until cheese is melted and sandwiches are golden brown on the other side, 2 to 3 minutes per side.",
        ""
      ],
      "times": [
        "5",
        "5",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/1090412.jpg"
    },
    "90": {
      "name": "Ultimate Grilled Cheese Sandwich",
      "ingredients": [
        "1/4 cup finely chopped Granny Smith apple",
        "1 tablespoon finely chopped pecans",
        "1 tablespoon creamy salad dressing (such as Miracle Whip®)",
        "1 tablespoon sour cream",
        "8 slices Colby cheese",
        "8 slices sourdough bread",
        "4 thick slices ham",
        "1/4 cup margarine"
      ],
      "directions": [
        "Stir together the apple, pecans, salad dressing, and sour cream; set aside. Place a slice of Colby cheese onto 4 of the bread slices, the add the ham, followed by the remaining slice of cheese and bread. Spread the margarine on the outside of the sandwiches.",
        "Place the sandwiches into a large skillet and cook over medium-high heat until the bread is golden brown on both sides and the cheese has melted, about 3 minutes per side. Spread the apple mixture into the middle of each sandwich before serving.",
        ""
      ],
      "times": [
        "10",
        "5",
        "15"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/715675.jpg"
    },
    "91": {
      "name": "Grilled Goat Cheese and Mango Chutney Sandwich",
      "ingredients": [
        "2 slices  sourdough bread",
        "2 ounces goat cheese, or more to taste",
        "1 1/2 tablespoons mango chutney (such as Patak's®), or more to taste",
        "1 tablespoon butter"
      ],
      "directions": [
        "Spread goat cheese onto one side of one slice of bread and mango chutney on one side of the other slice of bread. Sandwich bread slices together around the goat cheese and chutney.",
        "Melt the butter in a small skillet over medium-low heat. Cook sandwich in melted butter, pressing with the back of a spatula occasionally to assure the cheese melts, until the bread is golden brown, 2 to 3 minutes per side.",
        ""
      ],
      "times": [
        "5",
        "5",
        "10"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/2099778.jpg"
    },
    "92": {
      "name": "Grilled Cheese and Veggie Sandwich",
      "ingredients": [
        "1 1/2 cups coleslaw mix",
        "1/2 cup bean sprouts",
        "8 thick slices (3/4 inch thick) sourdough bread",
        "3 tablespoons margarine, softened",
        "3 tablespoons honey mustard",
        "6 ounces sliced Havarti cheese"
      ],
      "directions": [
        "In a medium bowl, toss together the coleslaw mix and bean sprouts.",
        "Spread one side of each bread slice with margarine. Spread opposite side of 4 slices with honey mustard. Layer the honey mustard side of the 4 bread slices with the coleslaw mixture and cheese. Top with remaining 4 bread slices, margarine side out.",
        "In a large skillet over medium heat, cook the sandwiches about 2 minutes on each side, until the cheese has melted and the bread is golden brown.",
        ""
      ],
      "times": [
        "15",
        "10",
        "25"
      ],
      "image": "https://images.media-allrecipes.com/userphotos/560x315/4025327.jpg"
    }
  }
}
